IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
<module name="MSS_CTRL_MSS_CTRL" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MSS_CTRL_PID" acronym="MSS_CTRL_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CONTROL" acronym="MSS_CTRL_R5SS0_CONTROL" offset="0x20" width="32" description="">
		<bitfield id="ROM_WAIT_STATE" width="3" begin="26" end="24" resetval="0x0" description="writing '111'  enables a single cycle wait state with respect to CR5A_clk for rom access.This needs to be set when R5 clock is at 400MHZ and Interconnect-clk is at 200MHZ. (because it is a timing issue in this scenario)" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="RESET_FSM_TRIGGER" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:writing 3'b111 will trigger the reset FSM. Reset FSM ensures reset to R5SS and inturn ensures the latching of lock_step and also mem_swap bit" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="LOCK_STEP_SWITCH_WAIT" width="3" begin="10" end="8" resetval="0x7" description="writing 3'b111 ensures switch happens only after R5SS reset. Orelse it will be a immediate switch." range="10 - 8" rwaccess="RW"/> 
		<bitfield id="LOCK_STEP" width="3" begin="2" end="0" resetval="0x7" description="writing 3'b000 ensures R5 to be in Dual-Core mode. Note: The change happens after the R5SS reset assertion if R5_CONTROL_lock_step_switch_wait is set. Or else the switiching to Dual-core happens on the fly." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_HALT" acronym="MSS_CTRL_R5SS0_CORE0_HALT" offset="0x24" width="8" description="">
		<bitfield id="HALT" width="3" begin="2" end="0" resetval="0x7" description="writing '000'  will unhalt CR5A. This register should be written only once." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_HALT" acronym="MSS_CTRL_R5SS0_CORE1_HALT" offset="0x28" width="8" description="">
		<bitfield id="HALT" width="3" begin="2" end="0" resetval="0x7" description="writing '000'  will unhalt for CR5B.  This register should be written only once." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_STATUS_REG" acronym="MSS_CTRL_R5SS0_STATUS_REG" offset="0x2C" width="8" description="">
		<bitfield id="LOCK_STEP" width="1" begin="8" end="8" resetval="0x0" description="Reading 1: confirms R5SS is in lockstep mode. Reading 0: confirms R5SS is in Dual-core mode." range="8" rwaccess="RO"/> 
		<bitfield id="MEMSWAP" width="1" begin="0" end="0" resetval="0x0" description="reading 1: confirms ROM is Eclipsed from with RAM for R5." range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_STAT" acronym="MSS_CTRL_R5SS0_CORE0_STAT" offset="0x30" width="8" description="">
		<bitfield id="WFE_STAT" width="1" begin="4" end="4" resetval="0x0" description="WFE Status" range="4" rwaccess="RO"/> 
		<bitfield id="WFI_STAT" width="1" begin="0" end="0" resetval="0x0" description="WFI Status" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_STAT" acronym="MSS_CTRL_R5SS0_CORE1_STAT" offset="0x34" width="8" description="">
		<bitfield id="WFE_STAT" width="1" begin="4" end="4" resetval="0x0" description="WFE Status" range="4" rwaccess="RO"/> 
		<bitfield id="WFI_STAT" width="1" begin="0" end="0" resetval="0x0" description="WFI Status" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_FORCE_WFI" acronym="MSS_CTRL_R5SS0_FORCE_WFI" offset="0x38" width="8" description="">
		<bitfield id="CR5_WFI_OVERIDE" width="3" begin="2" end="0" resetval="0x0" description="writing 3'b111 will force the wfi signals of R5SS to 1" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CONTROL" acronym="MSS_CTRL_R5SS1_CONTROL" offset="0x40" width="24" description="">
		<bitfield id="RESET_FSM_TRIGGER" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:writing 3'b111 will trigger the reset FSM. Reset FSM ensures reset to R5SS and inturn ensures the latching of lock_step and also mem_swap bit" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="LOCK_STEP_SWITCH_WAIT" width="3" begin="10" end="8" resetval="0x7" description="writing 3'b111 ensures switch happens only after R5SS reset. Orelse it will be a immediate switch." range="10 - 8" rwaccess="RW"/> 
		<bitfield id="LOCK_STEP" width="3" begin="2" end="0" resetval="0x7" description="writing 3'b000 ensures R5 to be in Dual-Core mode. Note: The change happens after the R5SS reset assertion if R5_CONTROL_lock_step_switch_wait is set. Or else the switiching to Dual-core happens on the fly." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE0_HALT" acronym="MSS_CTRL_R5SS1_CORE0_HALT" offset="0x44" width="8" description="">
		<bitfield id="HALT" width="3" begin="2" end="0" resetval="0x7" description="writing '000'  will unhalt CR5A. This register should be written only once." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_HALT" acronym="MSS_CTRL_R5SS1_CORE1_HALT" offset="0x48" width="8" description="">
		<bitfield id="HALT" width="3" begin="2" end="0" resetval="0x7" description="writing '000'  will unhalt for CR5B.  This register should be written only once." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_STATUS_REG" acronym="MSS_CTRL_R5SS1_STATUS_REG" offset="0x4C" width="8" description="">
		<bitfield id="LOCK_STEP" width="1" begin="8" end="8" resetval="0x0" description="Reading 1: confirms R5SS is in lockstep mode. Reading 0: confirms R5SS is in Dual-core mode." range="8" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE0_STAT" acronym="MSS_CTRL_R5SS1_CORE0_STAT" offset="0x50" width="8" description="">
		<bitfield id="WFE_STAT" width="1" begin="4" end="4" resetval="0x0" description="WFE Status" range="4" rwaccess="RO"/> 
		<bitfield id="WFI_STAT" width="1" begin="0" end="0" resetval="0x0" description="WFI Status" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_STAT" acronym="MSS_CTRL_R5SS1_CORE1_STAT" offset="0x54" width="8" description="">
		<bitfield id="WFE_STAT" width="1" begin="4" end="4" resetval="0x0" description="WFE Status" range="4" rwaccess="RO"/> 
		<bitfield id="WFI_STAT" width="1" begin="0" end="0" resetval="0x0" description="WFI Status" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_FORCE_WFI" acronym="MSS_CTRL_R5SS1_FORCE_WFI" offset="0x58" width="8" description="">
		<bitfield id="CR5_WFI_OVERIDE" width="3" begin="2" end="0" resetval="0x0" description="writing 3'b111 will force the wfi signals of R5SS to 1" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_ROM_ECLIPSE" acronym="MSS_CTRL_R5SS0_ROM_ECLIPSE" offset="0x80" width="16" description="">
		<bitfield id="MEMSWAP_WAIT" width="3" begin="10" end="8" resetval="0x7" description="writing 3'b111 ensures ROM-Eclipsing happens only after R5SS reset. Orelse it will be a immediate change." range="10 - 8" rwaccess="RW"/> 
		<bitfield id="MEMSWAP" width="3" begin="2" end="0" resetval="0x0" description="writing '111' ensures eclipsing of CR5A_ROM immediately if memswap_wait is not set. If memswap_wait is set then ROM is eclipsed after R5SS reset assertion." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_TEINIT" acronym="MSS_CTRL_R5SS0_TEINIT" offset="0x90" width="0" description="">
		<bitfield id="TEINIT" width="1" begin="0" end="0" resetval="0x0" description="Exception handling state at reset. 0-ARM 1-Thumb" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_TEINIT" acronym="MSS_CTRL_R5SS1_TEINIT" offset="0x94" width="0" description="">
		<bitfield id="TEINIT" width="1" begin="0" end="0" resetval="0x0" description="Exception handling state at reset. 0-ARM 1-Thumb" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_AHB_EN" acronym="MSS_CTRL_R5SS0_AHB_EN" offset="0x98" width="24" description="">
		<bitfield id="CPU1_AHB_INIT" width="3" begin="18" end="16" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedSignal decides whehter ahb interface is enabled or not." range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CPU0_AHB_INIT" width="3" begin="2" end="0" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedSignal decides whehter ahb interface is enabled or not." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_AHB_EN" acronym="MSS_CTRL_R5SS1_AHB_EN" offset="0x9C" width="24" description="">
		<bitfield id="CPU1_AHB_INIT" width="3" begin="18" end="16" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedSignal decides whehter ahb interface is enabled or not." range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CPU0_AHB_INIT" width="3" begin="2" end="0" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedSignal decides whehter ahb interface is enabled or not." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AHB_BASE" acronym="MSS_CTRL_R5SS0_CORE0_AHB_BASE" offset="0xA0" width="24" description="">
		<bitfield id="AHB_BASE" width="20" begin="19" end="0" resetval="0x327680" description="Ti internal Register. Modifying this register is not recommendedDecides the base address of ahb region" range="19 - 0" rwaccess="RW"/>
	</register>
