IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_R5SS1_CORE0_AHB_BASE" acronym="MSS_CTRL_R5SS1_CORE0_AHB_BASE" offset="0xA4" width="24" description="">
		<bitfield id="AHB_BASE" width="20" begin="19" end="0" resetval="0x327680" description="Ti internal Register. Modifying this register is not recommendedDecides the base address of ahb region" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AHB_SIZE" acronym="MSS_CTRL_R5SS0_CORE0_AHB_SIZE" offset="0xA8" width="8" description="">
		<bitfield id="AHB_SIZE" width="5" begin="4" end="0" resetval="0x19" description="Ti internal Register. Modifying this register is not recommendedCode for selecting size for ahb.b00011    4KBb00100    8KBb00101    16KBb00110    32KBb00111    64KBb01000    128KBb01001    256KBb01010    512KBb01011    1MBb01100    2MBb01101    4MBb01110    8MBb01111    16MBb10000    32MBb10001    64MBb10010    128MBb10011    256MBb10100    512MBb10101    1GBb10110    2GBb10111    4GB" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE0_AHB_SIZE" acronym="MSS_CTRL_R5SS1_CORE0_AHB_SIZE" offset="0xAC" width="8" description="">
		<bitfield id="AHB_SIZE" width="5" begin="4" end="0" resetval="0x19" description="Ti internal Register. Modifying this register is not recommendedCode for selecting size for ahb.b00011    4KBb00100    8KBb00101    16KBb00110    32KBb00111    64KBb01000    128KBb01001    256KBb01010    512KBb01011    1MBb01100    2MBb01101    4MBb01110    8MBb01111    16MBb10000    32MBb10001    64MBb10010    128MBb10011    256MBb10100    512MBb10101    1GBb10110    2GBb10111    4GB" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AHB_BASE" acronym="MSS_CTRL_R5SS0_CORE1_AHB_BASE" offset="0xB0" width="24" description="">
		<bitfield id="AHB_BASE" width="20" begin="19" end="0" resetval="0x327680" description="Ti internal Register. Modifying this register is not recommendedDecides the base address of ahb region" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_AHB_BASE" acronym="MSS_CTRL_R5SS1_CORE1_AHB_BASE" offset="0xB4" width="24" description="">
		<bitfield id="AHB_BASE" width="20" begin="19" end="0" resetval="0x327680" description="Ti internal Register. Modifying this register is not recommendedDecides the base address of ahb region" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AHB_SIZE" acronym="MSS_CTRL_R5SS0_CORE1_AHB_SIZE" offset="0xB8" width="8" description="">
		<bitfield id="AHB_SIZE" width="5" begin="4" end="0" resetval="0x19" description="Ti internal Register. Modifying this register is not recommendedCode for selecting size for ahb.b00011    4KBb00100    8KBb00101    16KBb00110    32KBb00111    64KBb01000    128KBb01001    256KBb01010    512KBb01011    1MBb01100    2MBb01101    4MBb01110    8MBb01111    16MBb10000    32MBb10001    64MBb10010    128MBb10011    256MBb10100    512MBb10101    1GBb10110    2GBb10111    4GB" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_AHB_SIZE" acronym="MSS_CTRL_R5SS1_CORE1_AHB_SIZE" offset="0xBC" width="8" description="">
		<bitfield id="AHB_SIZE" width="5" begin="4" end="0" resetval="0x19" description="Ti internal Register. Modifying this register is not recommendedCode for selecting size for ahb.b00011    4KBb00100    8KBb00101    16KBb00110    32KBb00111    64KBb01000    128KBb01001    256KBb01010    512KBb01011    1MBb01100    2MBb01101    4MBb01110    8MBb01111    16MBb10000    32MBb10001    64MBb10010    128MBb10011    256MBb10100    512MBb10101    1GBb10110    2GBb10111    4GB" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_TCM_EXT_ERR_EN" acronym="MSS_CTRL_R5SS0_TCM_EXT_ERR_EN" offset="0xC0" width="24" description="">
		<bitfield id="CPU1_TCM" width="3" begin="18" end="16" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedTCMs external error enable. Tie each bit high to enable the external error signal for each TCM at reset" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CPU0_TCM" width="3" begin="2" end="0" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedTCMs external error enable. Tie each bit high to enable the external error signal for each TCM at reset" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_TCM_EXT_ERR_EN" acronym="MSS_CTRL_R5SS1_TCM_EXT_ERR_EN" offset="0xC4" width="24" description="">
		<bitfield id="CPU1_TCM" width="3" begin="18" end="16" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedTCMs external error enable. Tie each bit high to enable the external error signal for each TCM at reset" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CPU0_TCM" width="3" begin="2" end="0" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedTCMs external error enable. Tie each bit high to enable the external error signal for each TCM at reset" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_TCM_ERR_EN" acronym="MSS_CTRL_R5SS0_TCM_ERR_EN" offset="0xC8" width="24" description="">
		<bitfield id="CPU1_TCM" width="3" begin="18" end="16" resetval="0x0" description="Ti internal Register. Modifying this register is not recommendedTCMs ECC check enable. Tie each bit high to enable ECC checking on appropraite TCM" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CPU0_TCM" width="3" begin="2" end="0" resetval="0x0" description="Ti internal Register. Modifying this register is not recommendedTCMs ECC check enable. Tie each bit high to enable ECC checking on appropraite TCM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_TCM_ERR_EN" acronym="MSS_CTRL_R5SS1_TCM_ERR_EN" offset="0xCC" width="24" description="">
		<bitfield id="CPU1_TCM" width="3" begin="18" end="16" resetval="0x0" description="Ti internal Register. Modifying this register is not recommendedTCMs ECC check enable. Tie each bit high to enable ECC checking on appropraite TCM" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CPU0_TCM" width="3" begin="2" end="0" resetval="0x0" description="Ti internal Register. Modifying this register is not recommendedTCMs ECC check enable. Tie each bit high to enable ECC checking on appropraite TCM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_INIT_TCM" acronym="MSS_CTRL_R5SS0_INIT_TCM" offset="0xD0" width="24" description="">
		<bitfield id="LOCKZRAM_CPU1" width="3" begin="22" end="20" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH ATCM base address at reset is 0x0 when LOW BTCM base address at reset is 0x0" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="TCMB_CPU1" width="3" begin="18" end="16" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH enables BTCM interface out of reset" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="TCMA_CPU1" width="3" begin="14" end="12" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH enables ATCM interface out of reset" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="LOCKZRAM_CPU0" width="3" begin="10" end="8" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH ATCM base address at reset is 0x0 when LOW BTCM base address at reset is 0x0" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="TCMB_CPU0" width="3" begin="6" end="4" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH enables BTCM interface out of reset" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="TCMA_CPU0" width="3" begin="2" end="0" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH enables ATCM interface out of reset" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_INIT_TCM" acronym="MSS_CTRL_R5SS1_INIT_TCM" offset="0xD4" width="24" description="">
		<bitfield id="LOCKZRAM_CPU1" width="3" begin="22" end="20" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH ATCM base address at reset is 0x0 when LOW BTCM base address at reset is 0x0" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="TCMB_CPU1" width="3" begin="18" end="16" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH enables BTCM interface out of reset" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="TCMA_CPU1" width="3" begin="14" end="12" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH enables ATCM interface out of reset" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="LOCKZRAM_CPU0" width="3" begin="10" end="8" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH ATCM base address at reset is 0x0 when LOW BTCM base address at reset is 0x0" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="TCMB_CPU0" width="3" begin="6" end="4" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH enables BTCM interface out of reset" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="TCMA_CPU0" width="3" begin="2" end="0" resetval="0x7" description="Ti internal Register. Modifying this register is not recommendedWhen HIGH enables ATCM interface out of reset" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_TCM_ECC_WRENZ_EN" acronym="MSS_CTRL_R5SS0_TCM_ECC_WRENZ_EN" offset="0xD8" width="24" description="">
		<bitfield id="CPU1_TCMB1_WRENZ_EN" width="3" begin="22" end="20" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMB0-RAM of CR5B.Writing '111' unblocks the writes to ECC-bits of TCMB1-RAM of CR5B" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="CPU1_TCMB0_WRENZ_EN" width="3" begin="18" end="16" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMB0-RAM of CR5B.Writing '111' unblocks the writes to ECC-bits of TCMB0-RAM of CR5B" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CPU1_TCMA_WRENZ_EN" width="3" begin="14" end="12" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMA-RAM of CR5B.Writing '111' unblocks the writes to ECC-bits of TCMA-RAM of CR5B" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="CPU0_TCMB1_WRENZ_EN" width="3" begin="10" end="8" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMB0-RAM of CR5A.Writing '111' unblocks the writes to ECC-bits of TCMB1-RAM of CR5A" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="CPU0_TCMB0_WRENZ_EN" width="3" begin="6" end="4" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMB0-RAM of CR5A.Writing '111' unblocks the writes to ECC-bits of TCMB0-RAM of CR5A" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="CPU0_TCMA_WRENZ_EN" width="3" begin="2" end="0" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMA-RAM of CR5A.Writing '111' unblocks the writes to ECC-bits of TCMA-RAM of CR5A" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_TCM_ECC_WRENZ_EN" acronym="MSS_CTRL_R5SS1_TCM_ECC_WRENZ_EN" offset="0xDC" width="24" description="">
		<bitfield id="CPU1_TCMB1_WRENZ_EN" width="3" begin="22" end="20" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMB0-RAM of CR5B.Writing '111' unblocks the writes to ECC-bits of TCMB1-RAM of CR5B" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="CPU1_TCMB0_WRENZ_EN" width="3" begin="18" end="16" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMB0-RAM of CR5B.Writing '111' unblocks the writes to ECC-bits of TCMB0-RAM of CR5B" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="CPU1_TCMA_WRENZ_EN" width="3" begin="14" end="12" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMA-RAM of CR5B.Writing '111' unblocks the writes to ECC-bits of TCMA-RAM of CR5B" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="CPU0_TCMB1_WRENZ_EN" width="3" begin="10" end="8" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMB0-RAM of CR5A.Writing '111' unblocks the writes to ECC-bits of TCMB1-RAM of CR5A" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="CPU0_TCMB0_WRENZ_EN" width="3" begin="6" end="4" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMB0-RAM of CR5A.Writing '111' unblocks the writes to ECC-bits of TCMB0-RAM of CR5A" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="CPU0_TCMA_WRENZ_EN" width="3" begin="2" end="0" resetval="0x7" description="writing '000'  blocks the writes to ECC-bits of TCMA-RAM of CR5A.Writing '111' unblocks the writes to ECC-bits of TCMA-RAM of CR5A" range="2 - 0" rwaccess="RW"/>
	</register>
