IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_BOOT_INFO_REG0" acronym="MSS_CTRL_BOOT_INFO_REG0" offset="0x100" width="32" description="">
		<bitfield id="CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_BOOT_INFO_REG1" acronym="MSS_CTRL_BOOT_INFO_REG1" offset="0x104" width="32" description="">
		<bitfield id="CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_BOOT_INFO_REG2" acronym="MSS_CTRL_BOOT_INFO_REG2" offset="0x108" width="32" description="">
		<bitfield id="CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_BOOT_INFO_REG3" acronym="MSS_CTRL_BOOT_INFO_REG3" offset="0x10C" width="32" description="">
		<bitfield id="CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_BOOT_INFO_REG4" acronym="MSS_CTRL_BOOT_INFO_REG4" offset="0x110" width="32" description="">
		<bitfield id="CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_BOOT_INFO_REG5" acronym="MSS_CTRL_BOOT_INFO_REG5" offset="0x114" width="32" description="">
		<bitfield id="CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_BOOT_INFO_REG6" acronym="MSS_CTRL_BOOT_INFO_REG6" offset="0x118" width="32" description="">
		<bitfield id="CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_BOOT_INFO_REG7" acronym="MSS_CTRL_BOOT_INFO_REG7" offset="0x11C" width="32" description="">
		<bitfield id="CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_ATCM_MEM_INIT" acronym="MSS_CTRL_R5SS0_ATCM_MEM_INIT" offset="0x200" width="0" description="">
		<bitfield id="MEM_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the ATCM banks of CR5A/B. Value in each row is initialized to 0x0C_0000_0000" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_ATCM_MEM_INIT_DONE" acronym="MSS_CTRL_R5SS0_ATCM_MEM_INIT_DONE" offset="0x204" width="0" description="">
		<bitfield id="MEM_INIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once initialization of ATCM banks is finished. Writing '1' would clear the bit." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_ATCM_MEM_INIT_STATUS" acronym="MSS_CTRL_R5SS0_ATCM_MEM_INIT_STATUS" offset="0x208" width="0" description="">
		<bitfield id="MEM_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for ATCM banks of CR5A/B1'b1: Initialization is in progress for ATCM banks of CR5A/B" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_BTCM_MEM_INIT" acronym="MSS_CTRL_R5SS0_BTCM_MEM_INIT" offset="0x210" width="0" description="">
		<bitfield id="MEM_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the B0/1TCM banks of CR5A/B" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_BTCM_MEM_INIT_DONE" acronym="MSS_CTRL_R5SS0_BTCM_MEM_INIT_DONE" offset="0x214" width="0" description="">
		<bitfield id="MEM_INIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once initialization of B0/1TCM banks is finished. Writing '1' would clear the bit." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_BTCM_MEM_INIT_STATUS" acronym="MSS_CTRL_R5SS0_BTCM_MEM_INIT_STATUS" offset="0x218" width="0" description="">
		<bitfield id="MEM_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for B0/1TCM banks of CR5A/B1'b1: Initialization is in progress for B0/1TCM banks of CR5A/B" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_ATCM_MEM_INIT" acronym="MSS_CTRL_R5SS1_ATCM_MEM_INIT" offset="0x220" width="0" description="">
		<bitfield id="MEM_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the ATCM banks of CR5A/B. Value in each row is initialized to 0x0C_0000_0000" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_ATCM_MEM_INIT_DONE" acronym="MSS_CTRL_R5SS1_ATCM_MEM_INIT_DONE" offset="0x224" width="0" description="">
		<bitfield id="MEM_INIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once initialization of ATCM banks is finished. Writing '1' would clear the bit." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_ATCM_MEM_INIT_STATUS" acronym="MSS_CTRL_R5SS1_ATCM_MEM_INIT_STATUS" offset="0x228" width="0" description="">
		<bitfield id="MEM_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for ATCM banks of CR5A/B1'b1: Initialization is in progress for ATCM banks of CR5A/B" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_BTCM_MEM_INIT" acronym="MSS_CTRL_R5SS1_BTCM_MEM_INIT" offset="0x230" width="0" description="">
		<bitfield id="MEM_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the B0/1TCM banks of CR5A/B" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_BTCM_MEM_INIT_DONE" acronym="MSS_CTRL_R5SS1_BTCM_MEM_INIT_DONE" offset="0x234" width="0" description="">
		<bitfield id="MEM_INIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once initialization of B0/1TCM banks is finished. Writing '1' would clear the bit." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_BTCM_MEM_INIT_STATUS" acronym="MSS_CTRL_R5SS1_BTCM_MEM_INIT_STATUS" offset="0x238" width="0" description="">
		<bitfield id="MEM_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for B0/1TCM banks of CR5A/B1'b1: Initialization is in progress for B0/1TCM banks of CR5A/B" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_L2IOCRAM_MEM_INIT" acronym="MSS_CTRL_L2IOCRAM_MEM_INIT" offset="0x240" width="8" description="">
		<bitfield id="PARTITION3" width="1" begin="3" end="3" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the L2 Bank3. Value in each row is initialized to 0x0" range="3" rwaccess="RW"/> 
		<bitfield id="PARTITION2" width="1" begin="2" end="2" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the L2 Bank2. Value in each row is initialized to 0x0" range="2" rwaccess="RW"/> 
		<bitfield id="PARTITION1" width="1" begin="1" end="1" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the L2 Bank1. Value in each row is initialized to 0x0" range="1" rwaccess="RW"/> 
		<bitfield id="PARTITION0" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the L2 Bank0. Value in each row is initialized to 0x0" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_L2OCRAM_MEM_INIT_DONE" acronym="MSS_CTRL_L2OCRAM_MEM_INIT_DONE" offset="0x244" width="8" description="">
		<bitfield id="PARTITION3" width="1" begin="3" end="3" resetval="0x0" description="This field will be high once intialization of L2 bank3 is finished. Writing '1' would clear the bit" range="3" rwaccess="RW"/> 
		<bitfield id="PARTITION2" width="1" begin="2" end="2" resetval="0x0" description="This field will be high once intialization of L2 bank2 is finished. Writing '1' would clear the bit" range="2" rwaccess="RW"/> 
		<bitfield id="PARTITION1" width="1" begin="1" end="1" resetval="0x0" description="This field will be high once intialization of L2 bank1 is finished. Writing '1' would clear the bit" range="1" rwaccess="RW"/> 
		<bitfield id="PARTITION0" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once intialization of L2 bank0 is finished. Writing '1' would clear the bit" range="0" rwaccess="RW"/>
	</register>
