IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_L2OCRAM_MEM_INIT_STATUS" acronym="MSS_CTRL_L2OCRAM_MEM_INIT_STATUS" offset="0x248" width="8" description="">
		<bitfield id="PARTITION3" width="1" begin="3" end="3" resetval="0x0" description="1'b0: No initialization is happening for L2 bank31'b1: Initialization is in progress for L2 bank3" range="3" rwaccess="RO"/> 
		<bitfield id="PARTITION2" width="1" begin="2" end="2" resetval="0x0" description="1'b0: No initialization is happening for L2 bank2 1'b1: Initialization is in progress for L2 bank2" range="2" rwaccess="RO"/> 
		<bitfield id="PARTITION1" width="1" begin="1" end="1" resetval="0x0" description="1'b0: No initialization is happening for L2 bank11'b1: Initialization is in progress for L2 bank1" range="1" rwaccess="RO"/> 
		<bitfield id="PARTITION0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for L2 bank0 1'b1: Initialization is in progress for L2 bank0" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_MAILBOXRAM_MEM_INIT" acronym="MSS_CTRL_MAILBOXRAM_MEM_INIT" offset="0x250" width="0" description="">
		<bitfield id="MEM0_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the MSS_MBOX. Value in each row is initialized to 0x0" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MAILBOXRAM_MEM_INIT_DONE" acronym="MSS_CTRL_MAILBOXRAM_MEM_INIT_DONE" offset="0x254" width="0" description="">
		<bitfield id="MEM0_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once intialization of MSS_MBOX is finished. Writing '1' would clear the bit" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MAILBOXRAM_MEM_INIT_STATUS" acronym="MSS_CTRL_MAILBOXRAM_MEM_INIT_STATUS" offset="0x258" width="0" description="">
		<bitfield id="MEM0_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for MSS_MBOX 1'b1: Initialization is in progress for MSS_MBOX" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_TPCC_MEM_INIT" acronym="MSS_CTRL_TPCC_MEM_INIT" offset="0x260" width="0" description="">
		<bitfield id="TPCC_A_MEMINIT_START" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the MSS_TPCCA" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPCC_MEM_INIT_DONE" acronym="MSS_CTRL_TPCC_MEM_INIT_DONE" offset="0x264" width="0" description="">
		<bitfield id="TPCC_A_MEMINIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once intialization of MSS_TPCCA is finished. Writing '1' would clear the bit" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPCC_MEMINIT_STATUS" acronym="MSS_CTRL_TPCC_MEMINIT_STATUS" offset="0x268" width="0" description="">
		<bitfield id="TPCC_A_MEMINIT_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for MSS_TPCCA1'b1: Initialization is in progress for MSS_TPCCB" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_TOP_PBIST_KEY_RST" acronym="MSS_CTRL_TOP_PBIST_KEY_RST" offset="0x300" width="8" description="">
		<bitfield id="PBIST_ST_RST" width="4" begin="7" end="4" resetval="0x0" description="MSS PBIST controller will be brought out of reset when value is 0xA" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="PBIST_ST_KEY" width="4" begin="3" end="0" resetval="0x0" description="Top PBIST Selftest Key. Valid value is 0x5" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TOP_PBIST_REG0" acronym="MSS_CTRL_TOP_PBIST_REG0" offset="0x304" width="32" description="">
		<bitfield id="PBIST_REG" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TOP_PBIST_REG1" acronym="MSS_CTRL_TOP_PBIST_REG1" offset="0x308" width="32" description="">
		<bitfield id="PBIST_REG" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TOP_PBIST_REG2" acronym="MSS_CTRL_TOP_PBIST_REG2" offset="0x30C" width="32" description="">
		<bitfield id="PBIST_REG" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CTI_TRIG_SEL" acronym="MSS_CTRL_R5SS0_CTI_TRIG_SEL" offset="0x400" width="16" description="">
		<bitfield id="TRIG1" width="8" begin="15" end="8" resetval="0x0" description="Used for selecting the trigger source for 1st trigger of MSS_R5SS" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG0" width="8" begin="7" end="0" resetval="0x0" description="Used for selecting the trigger source for 0th trigger of MSS_R5SS" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CTI_TRIG_SEL" acronym="MSS_CTRL_R5SS1_CTI_TRIG_SEL" offset="0x404" width="16" description="">
		<bitfield id="TRIG1" width="8" begin="15" end="8" resetval="0x0" description="Used for selecting the trigger source for 1st trigger of MSS_R5SS" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG0" width="8" begin="7" end="0" resetval="0x0" description="Used for selecting the trigger source for 0th trigger of MSS_R5SS" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_DBGSS_CTI_TRIG_SEL" acronym="MSS_CTRL_DBGSS_CTI_TRIG_SEL" offset="0x408" width="32" description="">
		<bitfield id="TRIG3" width="8" begin="31" end="24" resetval="0x0" description="Used for selecting the trigger source for 3rd trigger  of ONE_MCU_CTI" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="TRIG2" width="8" begin="23" end="16" resetval="0x0" description="Used for selecting the trigger source for 2nd trigger of ONE_MCU_CTI" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="TRIG1" width="8" begin="15" end="8" resetval="0x0" description="Used for selecting the trigger source for 1st trigger  of ONE_MCU_CTI" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG0" width="8" begin="7" end="0" resetval="0x0" description="Used for selecting the trigger source for 0th trigger  of ONE_MCU_CTI" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_DEBUGSS_CSETB_FLUSH" acronym="MSS_CTRL_DEBUGSS_CSETB_FLUSH" offset="0x40C" width="16" description="">
		<bitfield id="CSETB_FULL" width="1" begin="10" end="10" resetval="0x0" description="When HIGH indicates that the ETB RAM has overflowed or wrapped around to address zero" range="10" rwaccess="RO"/> 
		<bitfield id="CSETB_ACQ_COMPLETE" width="1" begin="9" end="9" resetval="0x0" description="When HIGH, indicates that trace acquisition is complete by ETB, that is, the trigger counter is at zero" range="9" rwaccess="RO"/> 
		<bitfield id="CSETB_FLUSHINACK" width="1" begin="8" end="8" resetval="0x0" description="Return acknowledgement to CSETBFLUSHIN" range="8" rwaccess="RO"/> 
		<bitfield id="CSETB_FLUSHIN" width="1" begin="0" end="0" resetval="0x0" description="External control used to assert the ATB signal AFVALIDS and drain any historical FIFO information on the bus" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_DEBUGSS_STM_NSGUAREN" acronym="MSS_CTRL_DEBUGSS_STM_NSGUAREN" offset="0x410" width="16" description="">
		<bitfield id="ENABLE" width="1" begin="10" end="10" resetval="0x0" description="Non secure guarenteed access control0:Access does not stall the CPU. Trace not guarenteed1: Access may stall. Trace guarenteed" range="10" rwaccess="RW"/>
	</register>
