IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_CPSW_HALTEN" acronym="MSS_CTRL_CPSW_HALTEN" offset="0x474" width="8" description="">
		<bitfield id="CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MCRC0_HALTEN" acronym="MSS_CTRL_MCRC0_HALTEN" offset="0x478" width="8" description="">
		<bitfield id="CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPTC_DBS_CONFIG" acronym="MSS_CTRL_TPTC_DBS_CONFIG" offset="0x800" width="8" description="">
		<bitfield id="TPTC_A1" width="2" begin="5" end="4" resetval="0x1" description="Default burst size tieoff value for TPTC_A1" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="TPTC_A0" width="2" begin="1" end="0" resetval="0x1" description="Default burst size tieoff value for TPTC_A0" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPTC_BOUNDARY_CFG" acronym="MSS_CTRL_TPTC_BOUNDARY_CFG" offset="0x804" width="16" description="">
		<bitfield id="TPTC_A1_SIZE" width="6" begin="13" end="8" resetval="0x19" description="6 bit signal used for deciding the boundary crossing size for CID-RID-SID reordering of MSS_TPTC_A1Example: writing 6'd19 decidies boundary to be 2^19  i.e. 512 KB" range="13 - 8" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_SIZE" width="6" begin="5" end="0" resetval="0x19" description="6 bit signal used for deciding the boundary crossing size for CID-RID-SID reordering of MSS_TPTC_A0Example: writing 6'd19 decidies boundary to be 2^19  i.e. 512 KB" range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPTC_XID_REORDER_CFG" acronym="MSS_CTRL_TPTC_XID_REORDER_CFG" offset="0x808" width="8" description="">
		<bitfield id="TPTC_A1_DISABLE" width="1" begin="8" end="8" resetval="0x0" description="writing 1'b1 will disable the CID-RID-SID reodering feature for MSS_TPTC_A1" range="8" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_DISABLE" width="1" begin="0" end="0" resetval="0x0" description="writing 1'b1 will disable the CID-RID-SID reodering feature for MSS_TPTC_A0" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_CPSW_CONTROL" acronym="MSS_CTRL_CPSW_CONTROL" offset="0x810" width="24" description="">
		<bitfield id="RGMII2_ID_MODE" width="1" begin="24" end="24" resetval="0x1" description="Internal delay mode for port 2. Only for TX0 : ID mode is disabled1 : ID mode is enabled" range="24" rwaccess="RW"/> 
		<bitfield id="RMII2_REF_CLK_SEL" width="1" begin="22" end="22" resetval="0x0" description="To select the rmii_ref_clk loopback mux output either from PAD or from MSS_RCM.   Write 0 to get clock will be from IO pad(pad loopback). Write 1 to get clock from internal loopback." range="22" rwaccess="RW"/> 
		<bitfield id="RMII2_REF_CLK_OE_N" width="1" begin="20" end="20" resetval="0x0" description="RMII_REF_CLK IO Output enable control0: Output enable1: Output Disable" range="20" rwaccess="RW"/> 
		<bitfield id="PORT2_MODE_SEL" width="3" begin="18" end="16" resetval="0x0" description="Port 2 Interface 000 = MII001 = RMII010 = RGMII011 - 111 = Not Supported" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="RGMII1_ID_MODE" width="1" begin="8" end="8" resetval="0x1" description="Internal delay mode for port 1. Only for TX0 : ID mode is disabled1 : ID mode is enabled" range="8" rwaccess="RW"/> 
		<bitfield id="RMII1_REF_CLK_SEL" width="1" begin="6" end="6" resetval="0x0" description="To select the rmii_ref_clk loopback mux output either from PAD or from MSS_RCM.   Write 0 to get clock will be from IO pad(pad loopback). Write 1 to get clock from internal source" range="6" rwaccess="RW"/> 
		<bitfield id="RMII1_REF_CLK_OE_N" width="1" begin="4" end="4" resetval="0x0" description="RMII_REF_CLK IO Output enable control0: Output enable1: Output Disable" range="4" rwaccess="RW"/> 
		<bitfield id="PORT1_MODE_SEL" width="3" begin="2" end="0" resetval="0x0" description="Port 1 Interface 000 = MII001 = RMII010 = RGMII011 - 111 = Not Supported" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_QSPI_CONFIG" acronym="MSS_CTRL_QSPI_CONFIG" offset="0x814" width="8" description="">
		<bitfield id="EXT_CLK" width="3" begin="2" end="0" resetval="0x0" description="Write 3'b111 to external clock as QSPI baud clock source     needed for DFT IO char." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_IDLE_CONTROL" acronym="MSS_CTRL_ICSSM_IDLE_CONTROL" offset="0x818" width="0" description="">
		<bitfield id="NOGATE" width="1" begin="0" end="0" resetval="0x1" description="Writing 1'b0 will enable local auto-clock gating (lower power) at IP level with increase in access/functional latency. Following IPs are controlled with this signalICSSM" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU0_GPI_SEL" acronym="MSS_CTRL_ICSSM_PRU0_GPI_SEL" offset="0x81C" width="32" description="">
		<bitfield id="SEL" width="30" begin="29" end="0" resetval="0x0" description="GPI or PWMXBar select for ICSM Port00: GPI1: PWMXBAR" range="29 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU1_GPI_SEL" acronym="MSS_CTRL_ICSSM_PRU1_GPI_SEL" offset="0x820" width="32" description="">
		<bitfield id="SEL" width="30" begin="29" end="0" resetval="0x0" description="GPI or PWMXBar select for ICSM Port00: GPI1: PWMXBAR" range="29 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU0_GPIO_OUT_CTRL" acronym="MSS_CTRL_ICSSM_PRU0_GPIO_OUT_CTRL" offset="0x824" width="32" description="">
		<bitfield id="OUTDISABLE" width="30" begin="29" end="0" resetval="0x0" description="GPO output disable for ICSSM Port 0 IO. Disable output for using the pin  as input. Each Bit maps to the corresponding bit in the IO0: Output Enable1: Output Disable" range="29 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU1_GPIO_OUT_CTRL" acronym="MSS_CTRL_ICSSM_PRU1_GPIO_OUT_CTRL" offset="0x828" width="32" description="">
		<bitfield id="OUTDISABLE" width="30" begin="29" end="0" resetval="0x0" description="GPO output disable for ICSSM Port 1 IO. Disable output for using the pin  as input. Each Bit maps to the corresponding bit in the IO0: Output Enable1: Output Disable" range="29 - 0" rwaccess="RW"/>
	</register>
