IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_GPMC_CONTROL" acronym="MSS_CTRL_GPMC_CONTROL" offset="0x82C" width="16" description="">
		<bitfield id="CLK_LB_OE_N" width="1" begin="12" end="12" resetval="0x0" description="GPMC_CLK_LB oe_n1: GPMC_dev_clk is driven to pad0: GPMC_dev_clk is not driven to pad" range="12" rwaccess="RW"/> 
		<bitfield id="CLK_OE_N" width="1" begin="8" end="8" resetval="0x1" description="GPMC_CLKOUT oe_n1: GPMC_dev_clk mux output is driven to pad0: GPMC_dev_clk mux output is not driven to pad" range="8" rwaccess="RW"/> 
		<bitfield id="CLK_LB_SEL" width="1" begin="4" end="4" resetval="0x0" description="GPMC_CLK_LB sel0: GPMC_CLK_LB pad clock1: GPMC_CLK pad clock" range="4" rwaccess="RW"/> 
		<bitfield id="CLKOUT_SEL" width="1" begin="0" end="0" resetval="0x0" description="GPMC_CLKOUT sel0: GPMC_func_clock1: GPMC_dev clock" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPCC0_INTAGG_MASK" acronym="MSS_CTRL_TPCC0_INTAGG_MASK" offset="0x830" width="24" description="">
		<bitfield id="TPTC_A1" width="1" begin="17" end="17" resetval="0x0" description="Mask Interrupt from TPTC A1 to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="17" rwaccess="RW"/> 
		<bitfield id="TPTC_A0" width="1" begin="16" end="16" resetval="0x0" description="Mask Interrupt from TPTC A0 to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="16" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT7" width="1" begin="8" end="8" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="8" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT6" width="1" begin="7" end="7" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="7" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT5" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="6" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT4" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT3" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT2" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT1" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT0" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt from TPCC A to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INTG" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPCC0_INTAGG_STATUS" acronym="MSS_CTRL_TPCC0_INTAGG_STATUS" offset="0x834" width="24" description="">
		<bitfield id="TPTC_A1" width="1" begin="17" end="17" resetval="0x0" description="Status of Interrupt from TPTC A1. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="17" rwaccess="RW"/> 
		<bitfield id="TPTC_A0" width="1" begin="16" end="16" resetval="0x0" description="Status of Interrupt from TPTC A0. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="16" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT7" width="1" begin="8" end="8" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="8" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT6" width="1" begin="7" end="7" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="7" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT5" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="6" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT4" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="5" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT3" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="4" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT2" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="3" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT1" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT0" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from TPCC A Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INTG" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
