IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_TPCC0_INTAGG_STATUS_RAW" acronym="MSS_CTRL_TPCC0_INTAGG_STATUS_RAW" offset="0x838" width="24" description="">
		<bitfield id="TPTC_A1" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Interrupt from TPTC A1. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_INTAGG_MASK" range="17" rwaccess="RW"/> 
		<bitfield id="TPTC_A0" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Interrupt from TPTC A0. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_INTAGG_MASK" range="16" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT7" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="8" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT6" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="7" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT5" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="6" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT4" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="5" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT3" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="4" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT2" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="3" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT1" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="2" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INT0" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from TPCC A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_INTAGG_MASK" range="1" rwaccess="RW"/> 
		<bitfield id="TPCC_A_INTG" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_HW_SPARE_RW0" acronym="MSS_CTRL_HW_SPARE_RW0" offset="0xFD0" width="32" description="">
		<bitfield id="HW_SPARE_RW0" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_HW_SPARE_RW1" acronym="MSS_CTRL_HW_SPARE_RW1" offset="0xFD4" width="32" description="">
		<bitfield id="HW_SPARE_RW1" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_HW_SPARE_RW2" acronym="MSS_CTRL_HW_SPARE_RW2" offset="0xFD8" width="32" description="">
		<bitfield id="HW_SPARE_RW2" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_HW_SPARE_RW3" acronym="MSS_CTRL_HW_SPARE_RW3" offset="0xFDC" width="32" description="">
		<bitfield id="HW_SPARE_RW3" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_HW_SPARE_RO0" acronym="MSS_CTRL_HW_SPARE_RO0" offset="0xFE0" width="32" description="">
		<bitfield id="HW_SPARE_RO0" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_HW_SPARE_RO1" acronym="MSS_CTRL_HW_SPARE_RO1" offset="0xFE4" width="32" description="">
		<bitfield id="HW_SPARE_RO1" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_HW_SPARE_RO2" acronym="MSS_CTRL_HW_SPARE_RO2" offset="0xFE8" width="32" description="">
		<bitfield id="HW_SPARE_RO2" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_HW_SPARE_RO3" acronym="MSS_CTRL_HW_SPARE_RO3" offset="0xFEC" width="32" description="">
		<bitfield id="HW_SPARE_RO3" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_HW_SPARE_REC" acronym="MSS_CTRL_HW_SPARE_REC" offset="0xFF0" width="32" description="">
		<bitfield id="HW_SPARE_REC31" width="1" begin="31" end="31" resetval="0x0" description="Reserved for HW R&#38;D" range="31" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC30" width="1" begin="30" end="30" resetval="0x0" description="Reserved for HW R&#38;D" range="30" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC29" width="1" begin="29" end="29" resetval="0x0" description="Reserved for HW R&#38;D" range="29" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC28" width="1" begin="28" end="28" resetval="0x0" description="Reserved for HW R&#38;D" range="28" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC27" width="1" begin="27" end="27" resetval="0x0" description="Reserved for HW R&#38;D" range="27" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC26" width="1" begin="26" end="26" resetval="0x0" description="Reserved for HW R&#38;D" range="26" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC25" width="1" begin="25" end="25" resetval="0x0" description="Reserved for HW R&#38;D" range="25" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC24" width="1" begin="24" end="24" resetval="0x0" description="Reserved for HW R&#38;D" range="24" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC23" width="1" begin="23" end="23" resetval="0x0" description="Reserved for HW R&#38;D" range="23" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC22" width="1" begin="22" end="22" resetval="0x0" description="Reserved for HW R&#38;D" range="22" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC21" width="1" begin="21" end="21" resetval="0x0" description="Reserved for HW R&#38;D" range="21" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC20" width="1" begin="20" end="20" resetval="0x0" description="Reserved for HW R&#38;D" range="20" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC19" width="1" begin="19" end="19" resetval="0x0" description="Reserved for HW R&#38;D" range="19" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC18" width="1" begin="18" end="18" resetval="0x0" description="Reserved for HW R&#38;D" range="18" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC17" width="1" begin="17" end="17" resetval="0x0" description="Reserved for HW R&#38;D" range="17" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC16" width="1" begin="16" end="16" resetval="0x0" description="Reserved for HW R&#38;D" range="16" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC15" width="1" begin="15" end="15" resetval="0x0" description="Reserved for HW R&#38;D" range="15" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC14" width="1" begin="14" end="14" resetval="0x0" description="Reserved for HW R&#38;D" range="14" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC13" width="1" begin="13" end="13" resetval="0x0" description="Reserved for HW R&#38;D" range="13" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC12" width="1" begin="12" end="12" resetval="0x0" description="Reserved for HW R&#38;D" range="12" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC11" width="1" begin="11" end="11" resetval="0x0" description="Reserved for HW R&#38;D" range="11" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC10" width="1" begin="10" end="10" resetval="0x0" description="Reserved for HW R&#38;D" range="10" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC9" width="1" begin="9" end="9" resetval="0x0" description="Reserved for HW R&#38;D" range="9" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC8" width="1" begin="8" end="8" resetval="0x0" description="Reserved for HW R&#38;D" range="8" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC7" width="1" begin="7" end="7" resetval="0x0" description="Reserved for HW R&#38;D" range="7" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC6" width="1" begin="6" end="6" resetval="0x0" description="Reserved for HW R&#38;D" range="6" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC5" width="1" begin="5" end="5" resetval="0x0" description="Reserved for HW R&#38;D" range="5" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC4" width="1" begin="4" end="4" resetval="0x0" description="Reserved for HW R&#38;D" range="4" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC3" width="1" begin="3" end="3" resetval="0x0" description="Reserved for HW R&#38;D" range="3" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC2" width="1" begin="2" end="2" resetval="0x0" description="Reserved for HW R&#38;D" range="2" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC1" width="1" begin="1" end="1" resetval="0x0" description="Reserved for HW R&#38;D" range="1" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC0" width="1" begin="0" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_LOCK0_KICK0" acronym="MSS_CTRL_LOCK0_KICK0" offset="0x1008" width="32" description="">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description="- KICK0 component" range="31 - 0" rwaccess="RW"/>
	</register>
