IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_FAULT_CLEAR" acronym="MSS_CTRL_FAULT_CLEAR" offset="0x1030" width="0" description="">
		<bitfield id="FAULT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Fault clear. Writing a 1 clears the current fault. Writing a 0 has no effect." range="0" rwaccess="WO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_MBOX_WRITE_DONE" acronym="MSS_CTRL_R5SS0_CORE0_MBOX_WRITE_DONE" offset="0x4000" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 7" range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 6" range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 5" range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 4" range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 3" range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 2" range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 1" range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_MBOX_READ_REQ" acronym="MSS_CTRL_R5SS0_CORE0_MBOX_READ_REQ" offset="0x4004" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This is request from  processor 7 to mss_cr5a. Requesting it to read from mailbox." range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This is request from  processor 6 to mss_cr5a. Requesting it to read from mailbox." range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This is request from  processor 5 to mss_cr5a. Requesting it to read from mailbox." range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This is request from  processor 4 to mss_cr5a. Requesting it to read from mailbox." range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This is request from  processor 3 to mss_cr5a. Requesting it to read from mailbox." range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This is request from  processor 2 to mss_cr5a. Requesting it to read from mailbox." range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This is request from  processor 1 to mss_cr5a. Requesting it to read from mailbox." range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This is request from  processor 0 to mss_cr5a. Requesting it to read from mailbox." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_MBOX_READ_DONE_ACK" acronym="MSS_CTRL_R5SS0_CORE0_MBOX_READ_DONE_ACK" offset="0x4008" width="8" description="">
		<bitfield id="PROC" width="8" begin="7" end="0" resetval="0x0" description="Write pulse bit field:For bits 0 to 7:Wrting1'b1 : Generates pulse interrupt to corresponding proc from MSS_CR5" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_MBOX_READ_DONE" acronym="MSS_CTRL_R5SS0_CORE0_MBOX_READ_DONE" offset="0x400C" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This register should be written once finishing reading from CR5A's mailbox written by proc 7" range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This register should be written once finishing reading from CR5A's mailbox written by proc 6" range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This register should be written once finishing reading from CR5A's mailbox written by proc 5" range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This register should be written once finishing reading from CR5A's mailbox written by proc 4" range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This register should be written once finishing reading from CR5A's mailbox written by proc 3" range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This register should be written once finishing reading from CR5A's mailbox written by proc 2" range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This register should be written once finishing reading from CR5A's mailbox written by proc 1" range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This register should be written once finishing reading from CR5A's mailbox written by proc 0" range="0" rwaccess="RW"/>
	</register>
