IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_R5SS0_CORE1_MBOX_READ_REQ" acronym="MSS_CTRL_R5SS0_CORE1_MBOX_READ_REQ" offset="0x8004" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This is request from  processor 7 to mss_CR5B. Requesting it to read from mailbox." range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This is request from  processor 6 to mss_CR5B. Requesting it to read from mailbox." range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This is request from  processor 5 to mss_CR5B. Requesting it to read from mailbox." range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This is request from  processor 4 to mss_CR5B. Requesting it to read from mailbox." range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This is request from  processor 3 to mss_CR5B. Requesting it to read from mailbox." range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This is request from  processor 2 to mss_CR5B. Requesting it to read from mailbox." range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This is request from  processor 1 to mss_CR5B. Requesting it to read from mailbox." range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This is request from  processor 0 to mss_CR5B. Requesting it to read from mailbox." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_MBOX_READ_DONE_ACK" acronym="MSS_CTRL_R5SS0_CORE1_MBOX_READ_DONE_ACK" offset="0x8008" width="8" description="">
		<bitfield id="PROC" width="8" begin="7" end="0" resetval="0x0" description="Write pulse bit field:For bits 0 to 7:Wrting1'b1 : Generates pulse interrupt to corresponding proc from MSS_CR5" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_MBOX_READ_DONE" acronym="MSS_CTRL_R5SS0_CORE1_MBOX_READ_DONE" offset="0x800C" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This register should be written once finishing reading from CR5B's mailbox written by proc 7" range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This register should be written once finishing reading from CR5B's mailbox written by proc 6" range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This register should be written once finishing reading from CR5B's mailbox written by proc 5" range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This register should be written once finishing reading from CR5B's mailbox written by proc 4" range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This register should be written once finishing reading from CR5B's mailbox written by proc 3" range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This register should be written once finishing reading from CR5B's mailbox written by proc 2" range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This register should be written once finishing reading from CR5B's mailbox written by proc 1" range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This register should be written once finishing reading from CR5B's mailbox written by proc 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_SW_INT" acronym="MSS_CTRL_R5SS0_CORE1_SW_INT" offset="0x8010" width="0" description="">
		<bitfield id="PULSE" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:writing 1'b1 to each bit will trigger MSS_SW_INT respectively to CR5A/B." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MPU_ADDR_ERRAGG_R5SS0_CPU1_MASK" acronym="MSS_CTRL_MPU_ADDR_ERRAGG_R5SS0_CPU1_MASK" offset="0x8020" width="24" description="">
		<bitfield id="MPU_HSM_ADDR_ERR" width="1" begin="17" end="17" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="17" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AHB_ADDR_ERR" width="1" begin="16" end="16" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="16" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AHB_ADDR_ERR" width="1" begin="15" end="15" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="15" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AHB_ADDR_ERR" width="1" begin="14" end="14" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="14" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AHB_ADDR_ERR" width="1" begin="13" end="13" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="13" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP1_ADDR_ERR" width="1" begin="12" end="12" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="12" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP0_ADDR_ERR" width="1" begin="11" end="11" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="11" rwaccess="RW"/> 
		<bitfield id="MPU_QSPI_ADDR_ERR" width="1" begin="10" end="10" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="10" rwaccess="RW"/> 
		<bitfield id="MPU_MBOX_ADDR_ERR" width="1" begin="9" end="9" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="9" rwaccess="RW"/> 
		<bitfield id="MPU_DTHE_A_ADDR_ERR" width="1" begin="8" end="8" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="8" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AXIS_ADDR_ERR" width="1" begin="7" end="7" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="7" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AXIS_ADDR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="6" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AXIS_ADDR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AXIS_ADDR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_D_ADDR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_C_ADDR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_B_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_A_ADDR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MPU_ADDR_ERRAGG_R5SS0_CPU1_STATUS" acronym="MSS_CTRL_MPU_ADDR_ERRAGG_R5SS0_CPU1_STATUS" offset="0x8024" width="24" description="">
		<bitfield id="MPU_HSM_ADDR_ERR" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AHB_ADDR_ERR" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AHB_ADDR_ERR" width="1" begin="15" end="15" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="15" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AHB_ADDR_ERR" width="1" begin="14" end="14" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="14" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AHB_ADDR_ERR" width="1" begin="13" end="13" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="13" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP1_ADDR_ERR" width="1" begin="12" end="12" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="12" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP0_ADDR_ERR" width="1" begin="11" end="11" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="11" rwaccess="RW"/> 
		<bitfield id="MPU_QSPI_ADDR_ERR" width="1" begin="10" end="10" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="10" rwaccess="RW"/> 
		<bitfield id="MPU_MBOX_ADDR_ERR" width="1" begin="9" end="9" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="9" rwaccess="RW"/> 
		<bitfield id="MPU_DTHE_A_ADDR_ERR" width="1" begin="8" end="8" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="8" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AXIS_ADDR_ERR" width="1" begin="7" end="7" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="7" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AXIS_ADDR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="6" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AXIS_ADDR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="5" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AXIS_ADDR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_D_ADDR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_C_ADDR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_B_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_A_ADDR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MPU_ADDR_ERRAGG_R5SS0_CPU1_STATUS_RAW" acronym="MSS_CTRL_MPU_ADDR_ERRAGG_R5SS0_CPU1_STATUS_RAW" offset="0x8028" width="24" description="">
		<bitfield id="MPU_HSM_ADDR_ERR" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="17" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AHB_ADDR_ERR" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="16" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AHB_ADDR_ERR" width="1" begin="15" end="15" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="15" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AHB_ADDR_ERR" width="1" begin="14" end="14" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="14" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AHB_ADDR_ERR" width="1" begin="13" end="13" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="13" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP1_ADDR_ERR" width="1" begin="12" end="12" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="12" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP0_ADDR_ERR" width="1" begin="11" end="11" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="11" rwaccess="RW"/> 
		<bitfield id="MPU_QSPI_ADDR_ERR" width="1" begin="10" end="10" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="10" rwaccess="RW"/> 
		<bitfield id="MPU_MBOX_ADDR_ERR" width="1" begin="9" end="9" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="9" rwaccess="RW"/> 
		<bitfield id="MPU_DTHE_A_ADDR_ERR" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="8" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AXIS_ADDR_ERR" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="7" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AXIS_ADDR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="6" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AXIS_ADDR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="5" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AXIS_ADDR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="4" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_D_ADDR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="3" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_C_ADDR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="2" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_B_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="1" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_A_ADDR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MPU_PROT_ERRAGG_R5SS0_CPU1_MASK" acronym="MSS_CTRL_MPU_PROT_ERRAGG_R5SS0_CPU1_MASK" offset="0x8030" width="24" description="">
		<bitfield id="MPU_HSM_PROT_ERR" width="1" begin="17" end="17" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="17" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AHB_PROT_ERR" width="1" begin="16" end="16" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="16" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AHB_PROT_ERR" width="1" begin="15" end="15" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="15" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AHB_PROT_ERR" width="1" begin="14" end="14" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="14" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AHB_PROT_ERR" width="1" begin="13" end="13" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="13" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP1_PROT_ERR" width="1" begin="12" end="12" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="12" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP0_PROT_ERR" width="1" begin="11" end="11" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="11" rwaccess="RW"/> 
		<bitfield id="MPU_QSPI_PROT_ERR" width="1" begin="10" end="10" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="10" rwaccess="RW"/> 
		<bitfield id="MPU_MBOX_PROT_ERR" width="1" begin="9" end="9" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="9" rwaccess="RW"/> 
		<bitfield id="MPU_DTHE_A_PROT_ERR" width="1" begin="8" end="8" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="8" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AXIS_PROT_ERR" width="1" begin="7" end="7" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="7" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AXIS_PROT_ERR" width="1" begin="6" end="6" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="6" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AXIS_PROT_ERR" width="1" begin="5" end="5" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AXIS_PROT_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_D_PROT_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_C_PROT_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_B_PROT_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_A_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="0" rwaccess="RW"/>
	</register>
