IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_MPU_PROT_ERRAGG_R5SS1_CPU1_STATUS" acronym="MSS_CTRL_MPU_PROT_ERRAGG_R5SS1_CPU1_STATUS" offset="0x10034" width="24" description="">
		<bitfield id="MPU_HSM_PROT_ERR" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AHB_PROT_ERR" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AHB_PROT_ERR" width="1" begin="15" end="15" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="15" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AHB_PROT_ERR" width="1" begin="14" end="14" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="14" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AHB_PROT_ERR" width="1" begin="13" end="13" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="13" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP1_PROT_ERR" width="1" begin="12" end="12" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="12" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP0_PROT_ERR" width="1" begin="11" end="11" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="11" rwaccess="RW"/> 
		<bitfield id="MPU_QSPI_PROT_ERR" width="1" begin="10" end="10" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="10" rwaccess="RW"/> 
		<bitfield id="MPU_MBOX_PROT_ERR" width="1" begin="9" end="9" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="9" rwaccess="RW"/> 
		<bitfield id="MPU_DTHE_A_PROT_ERR" width="1" begin="8" end="8" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="8" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AXIS_PROT_ERR" width="1" begin="7" end="7" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="7" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AXIS_PROT_ERR" width="1" begin="6" end="6" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="6" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AXIS_PROT_ERR" width="1" begin="5" end="5" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="5" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AXIS_PROT_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_D_PROT_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_C_PROT_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_B_PROT_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_A_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MPU_PROT_ERRAGG_R5SS1_CPU1_STATUS_RAW" acronym="MSS_CTRL_MPU_PROT_ERRAGG_R5SS1_CPU1_STATUS_RAW" offset="0x10038" width="24" description="">
		<bitfield id="MPU_HSM_PROT_ERR" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="17" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AHB_PROT_ERR" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="16" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AHB_PROT_ERR" width="1" begin="15" end="15" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="15" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AHB_PROT_ERR" width="1" begin="14" end="14" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="14" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AHB_PROT_ERR" width="1" begin="13" end="13" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="13" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP1_PROT_ERR" width="1" begin="12" end="12" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="12" rwaccess="RW"/> 
		<bitfield id="MPU_SCRM2SCRP0_PROT_ERR" width="1" begin="11" end="11" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="11" rwaccess="RW"/> 
		<bitfield id="MPU_QSPI_PROT_ERR" width="1" begin="10" end="10" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="10" rwaccess="RW"/> 
		<bitfield id="MPU_MBOX_PROT_ERR" width="1" begin="9" end="9" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="9" rwaccess="RW"/> 
		<bitfield id="MPU_DTHE_A_PROT_ERR" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="8" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B1_AXIS_PROT_ERR" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="7" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A1_AXIS_PROT_ERR" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="6" rwaccess="RW"/> 
		<bitfield id="MPU_CR5B0_AXIS_PROT_ERR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="5" rwaccess="RW"/> 
		<bitfield id="MPU_CR5A0_AXIS_PROT_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="4" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_D_PROT_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="3" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_C_PROT_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="2" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_B_PROT_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="1" rwaccess="RW"/> 
		<bitfield id="MPU_L2_BANK_A_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU0_MBOX_WRITE_DONE" acronym="MSS_CTRL_ICSSM_PRU0_MBOX_WRITE_DONE" offset="0x14000" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 7" range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 6" range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 5" range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 4" range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 3" range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 2" range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 1" range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU0_MBOX_READ_REQ" acronym="MSS_CTRL_ICSSM_PRU0_MBOX_READ_REQ" offset="0x14004" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This is request from  processor 7 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This is request from  processor 6 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This is request from  processor 5 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This is request from  processor 4 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This is request from  processor 3 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This is request from  processor 2 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This is request from  processor 1 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This is request from  processor 0 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU0_MBOX_READ_DONE_ACK" acronym="MSS_CTRL_ICSSM_PRU0_MBOX_READ_DONE_ACK" offset="0x14008" width="8" description="">
		<bitfield id="PROC" width="8" begin="7" end="0" resetval="0x0" description="Write pulse bit field:For bits 0 to 7:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU0.For bits 8 to 15:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU1." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU0_MBOX_READ_DONE" acronym="MSS_CTRL_ICSSM_PRU0_MBOX_READ_DONE" offset="0x1400C" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 7" range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 6" range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 5" range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 4" range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 3" range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 2" range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 1" range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU1_MBOX_WRITE_DONE" acronym="MSS_CTRL_ICSSM_PRU1_MBOX_WRITE_DONE" offset="0x14010" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 7" range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 6" range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 5" range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 4" range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 3" range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 2" range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 1" range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="Write pulse bit field:This register should be written once finishing writing into the mailbox memory of processor 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU1_MBOX_READ_REQ" acronym="MSS_CTRL_ICSSM_PRU1_MBOX_READ_REQ" offset="0x14014" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This is request from  processor 7 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This is request from  processor 6 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This is request from  processor 5 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This is request from  processor 4 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This is request from  processor 3 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This is request from  processor 2 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This is request from  processor 1 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This is request from  processor 0 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU1_MBOX_READ_DONE_ACK" acronym="MSS_CTRL_ICSSM_PRU1_MBOX_READ_DONE_ACK" offset="0x14018" width="8" description="">
		<bitfield id="PROC" width="8" begin="7" end="0" resetval="0x0" description="Write pulse bit field:For bits 0 to 7:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU0.For bits 8 to 15:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU1." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_ICSSM_PRU1_MBOX_READ_DONE" acronym="MSS_CTRL_ICSSM_PRU1_MBOX_READ_DONE" offset="0x1401C" width="32" description="">
		<bitfield id="PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 7" range="28" rwaccess="RW"/> 
		<bitfield id="PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 6" range="24" rwaccess="RW"/> 
		<bitfield id="PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 5" range="20" rwaccess="RW"/> 
		<bitfield id="PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 4" range="16" rwaccess="RW"/> 
		<bitfield id="PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 3" range="12" rwaccess="RW"/> 
		<bitfield id="PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 2" range="8" rwaccess="RW"/> 
		<bitfield id="PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 1" range="4" rwaccess="RW"/> 
		<bitfield id="PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This register should be written once finishing reading from corresponding ICSSM_PRU's mailbox written by proc 0" range="0" rwaccess="RW"/>
	</register>
