IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_TPCC0_ERRAGG_MASK" acronym="MSS_CTRL_TPCC0_ERRAGG_MASK" offset="0x18000" width="32" description="">
		<bitfield id="TPTC_A1_READ_ACCESS_ERROR" width="1" begin="26" end="26" resetval="0x0" description="Mask Error from MSS_TPTC_A1 to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="26" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_READ_ACCESS_ERROR" width="1" begin="25" end="25" resetval="0x0" description="Mask Error from MSS_TPTC_A0 to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="25" rwaccess="RW"/> 
		<bitfield id="TPCC_A_READ_ACCESS_ERROR" width="1" begin="24" end="24" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="24" rwaccess="RW"/> 
		<bitfield id="TPTC_A1_WRITE_ACCESS_ERROR" width="1" begin="18" end="18" resetval="0x0" description="Mask Error from MSS_TPTC_A1 to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="18" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_WRITE_ACCESS_ERROR" width="1" begin="17" end="17" resetval="0x0" description="Mask Error from MSS_TPTC_A0 to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="17" rwaccess="RW"/> 
		<bitfield id="TPCC_A_WRITE_ACCESS_ERROR" width="1" begin="16" end="16" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="16" rwaccess="RW"/> 
		<bitfield id="TPCC_A_PAR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="TPTC_A1_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MSS_TPTC_A1 to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MSS_TPTC_A0 to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="TPCC_A_MPINT" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="TPCC_A_ERRINT" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPCC0_ERRAGG_STATUS" acronym="MSS_CTRL_TPCC0_ERRAGG_STATUS" offset="0x18004" width="32" description="">
		<bitfield id="TPTC_A1_READ_ACCESS_ERROR" width="1" begin="26" end="26" resetval="0x0" description="Status of Error from MSS_TPTC_A1. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="26" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_READ_ACCESS_ERROR" width="1" begin="25" end="25" resetval="0x0" description="Status of Error from MSS_TPTC_A0. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="25" rwaccess="RW"/> 
		<bitfield id="TPCC_A_READ_ACCESS_ERROR" width="1" begin="24" end="24" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="24" rwaccess="RW"/> 
		<bitfield id="TPTC_A1_WRITE_ACCESS_ERROR" width="1" begin="18" end="18" resetval="0x0" description="Status of Error from MSS_TPTC_A1. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="18" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_WRITE_ACCESS_ERROR" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MSS_TPTC_A0. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="RW"/> 
		<bitfield id="TPCC_A_WRITE_ACCESS_ERROR" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="RW"/> 
		<bitfield id="TPCC_A_PAR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="RW"/> 
		<bitfield id="TPTC_A1_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MSS_TPTC_A1. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MSS_TPTC_A0. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="RW"/> 
		<bitfield id="TPCC_A_MPINT" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="RW"/> 
		<bitfield id="TPCC_A_ERRINT" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPCC0_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_TPCC0_ERRAGG_STATUS_RAW" offset="0x18008" width="32" description="">
		<bitfield id="TPTC_A1_READ_ACCESS_ERROR" width="1" begin="26" end="26" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A1. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="26" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_READ_ACCESS_ERROR" width="1" begin="25" end="25" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A0. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="25" rwaccess="RW"/> 
		<bitfield id="TPCC_A_READ_ACCESS_ERROR" width="1" begin="24" end="24" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="24" rwaccess="RW"/> 
		<bitfield id="TPTC_A1_WRITE_ACCESS_ERROR" width="1" begin="18" end="18" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A1. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="18" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_WRITE_ACCESS_ERROR" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A0. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="17" rwaccess="RW"/> 
		<bitfield id="TPCC_A_WRITE_ACCESS_ERROR" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="16" rwaccess="RW"/> 
		<bitfield id="TPCC_A_PAR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="4" rwaccess="RW"/> 
		<bitfield id="TPTC_A1_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A1. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="3" rwaccess="RW"/> 
		<bitfield id="TPTC_A0_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A0. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="2" rwaccess="RW"/> 
		<bitfield id="TPCC_A_MPINT" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="1" rwaccess="RW"/> 
		<bitfield id="TPCC_A_ERRINT" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MMR_ACCESS_ERRAGG_MASK0" acronym="MSS_CTRL_MMR_ACCESS_ERRAGG_MASK0" offset="0x18010" width="16" description="">
		<bitfield id="HSM_CTRL_WR" width="1" begin="11" end="11" resetval="0x0" description="Mask Interrupt from HSM_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="11" rwaccess="RW"/> 
		<bitfield id="HSM_CTRL_RD" width="1" begin="10" end="10" resetval="0x0" description="Mask Interrupt from HSM_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="10" rwaccess="RW"/> 
		<bitfield id="HSM_SOC_CTRL_WR" width="1" begin="9" end="9" resetval="0x0" description="Mask Interrupt from HSM_SOC_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="9" rwaccess="RW"/> 
		<bitfield id="HSM_SOC_CTRL_RD" width="1" begin="8" end="8" resetval="0x0" description="Mask Interrupt from HSM_SOC_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="8" rwaccess="RW"/> 
		<bitfield id="TOP_RCM_WR" width="1" begin="7" end="7" resetval="0x0" description="Mask Interrupt from TOP_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="7" rwaccess="RW"/> 
		<bitfield id="TOP_RCM_RD" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt from TOP_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="6" rwaccess="RW"/> 
		<bitfield id="TOP_CTRL_WR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt from TOP_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="TOP_CTRL_RD" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt from TOP_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="MSS_RCM_WR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt from MSS_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="MSS_RCM_RD" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt from MSS_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="MSS_CTRL_WR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt from MSS_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="MSS_CTRL_RD" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt from MSS_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1 : Interrupt is Masked0 : Interrupt is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MMR_ACCESS_ERRAGG_STATUS0" acronym="MSS_CTRL_MMR_ACCESS_ERRAGG_STATUS0" offset="0x18014" width="16" description="">
		<bitfield id="HSM_CTRL_WR" width="1" begin="11" end="11" resetval="0x0" description="Status of Interrupt from HSM_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="11" rwaccess="RW"/> 
		<bitfield id="HSM_CTRL_RD" width="1" begin="10" end="10" resetval="0x0" description="Status of Interrupt from HSM_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="10" rwaccess="RW"/> 
		<bitfield id="HSM_SOC_CTRL_WR" width="1" begin="9" end="9" resetval="0x0" description="Status of Interrupt from HSM_SOC_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="9" rwaccess="RW"/> 
		<bitfield id="HSM_SOC_CTRL_RD" width="1" begin="8" end="8" resetval="0x0" description="Status of Interrupt from HSM_SOC_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="8" rwaccess="RW"/> 
		<bitfield id="TOP_RCM_WR" width="1" begin="7" end="7" resetval="0x0" description="Status of Interrupt from TOP_RCMSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="7" rwaccess="RW"/> 
		<bitfield id="TOP_RCM_RD" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from TOP_RCMSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="6" rwaccess="RW"/> 
		<bitfield id="TOP_CTRL_WR" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from TOP_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="5" rwaccess="RW"/> 
		<bitfield id="TOP_CTRL_RD" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from TOP_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="4" rwaccess="RW"/> 
		<bitfield id="MSS_RCM_WR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from MSS_RCMSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="3" rwaccess="RW"/> 
		<bitfield id="MSS_RCM_RD" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from MSS_RCMSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="MSS_CTRL_WR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from MSS_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="MSS_CTRL_RD" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from MSS_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MMR_ACCESS_ERRAGG_STATUS_RAW0" acronym="MSS_CTRL_MMR_ACCESS_ERRAGG_STATUS_RAW0" offset="0x18018" width="16" description="">
		<bitfield id="HSM_CTRL_WR" width="1" begin="11" end="11" resetval="0x0" description="Raw Status of Interrupt from HSM_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="11" rwaccess="RW"/> 
		<bitfield id="HSM_CTRL_RD" width="1" begin="10" end="10" resetval="0x0" description="Raw Status of Interrupt from HSM_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="10" rwaccess="RW"/> 
		<bitfield id="HSM_SOC_CTRL_WR" width="1" begin="9" end="9" resetval="0x0" description="Raw Status of Interrupt from HSM_SOC_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="9" rwaccess="RW"/> 
		<bitfield id="HSM_SOC_CTRL_RD" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Interrupt from HSM_SOC_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="8" rwaccess="RW"/> 
		<bitfield id="TOP_RCM_WR" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Interrupt from TOP_RCM. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="7" rwaccess="RW"/> 
		<bitfield id="TOP_RCM_RD" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from TOP_RCM. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="6" rwaccess="RW"/> 
		<bitfield id="TOP_CTRL_WR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from TOP_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="5" rwaccess="RW"/> 
		<bitfield id="TOP_CTRL_RD" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from TOP_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="4" rwaccess="RW"/> 
		<bitfield id="MSS_RCM_WR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from MSS_RCM. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="3" rwaccess="RW"/> 
		<bitfield id="MSS_RCM_RD" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from MSS_RCM. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="2" rwaccess="RW"/> 
		<bitfield id="MSS_CTRL_WR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from MSS_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="1" rwaccess="RW"/> 
		<bitfield id="MSS_CTRL_RD" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from MSS_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CPU0_ECC_CORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS0_CPU0_ECC_CORR_ERRAGG_MASK" offset="0x18080" width="8" description="">
		<bitfield id="R5SS0_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="6" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS0_CPU0_ECC_CORR_ERRAGG_STATUS" offset="0x18084" width="8" description="">
		<bitfield id="R5SS0_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
