IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS0_CPU1_ECC_CORR_ERRAGG_STATUS_RAW" offset="0x180A8" width="8" description="">
		<bitfield id="R5SS0_CPU1_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CPU1_ECC_UNCORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS0_CPU1_ECC_UNCORR_ERRAGG_MASK" offset="0x180B0" width="8" description="">
		<bitfield id="R5SS0_CPU1_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS" offset="0x180B4" width="8" description="">
		<bitfield id="R5SS0_CPU1_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS0_CPU1_ECC_UNCORR_ERRAGG_STATUS_RAW" offset="0x180B8" width="8" description="">
		<bitfield id="R5SS0_CPU1_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="R5SS0_CPU1_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_UNCORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CPU0_ECC_CORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS1_CPU0_ECC_CORR_ERRAGG_MASK" offset="0x180C0" width="8" description="">
		<bitfield id="R5SS1_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="6" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS" offset="0x180C4" width="8" description="">
		<bitfield id="R5SS1_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS1_CPU0_ECC_CORR_ERRAGG_STATUS_RAW" offset="0x180C8" width="8" description="">
		<bitfield id="R5SS1_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="6" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="5" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="4" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="3" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ATCM_CORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from correctable error of corresponding CPUSet only if Interupt is unmasked in corresponding R5SS*_CPU*_ECC_CORR_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CPU0_ECC_UNCORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS1_CPU0_ECC_UNCORR_ERRAGG_MASK" offset="0x180D0" width="8" description="">
		<bitfield id="R5SS1_CPU0_DDATA_UNCORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_DTAG_UNCORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B0TCM_UNCORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B1TCM_UNCORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ATCM_UNCORR_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="0" rwaccess="RW"/>
	</register>
