IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_R5SS0_TCM_ADDRPARITY_CLR" acronym="MSS_CTRL_R5SS0_TCM_ADDRPARITY_CLR" offset="0x18120" width="24" description="">
		<bitfield id="B1TCM1_ERRADDR_CLR" width="3" begin="22" end="20" resetval="0x0" description="Write pulse bit field:writing 3'b111 clears  the Address latched after parity error for B1TCM of CR5B" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="B1TCM0_ERRADDR_CLR" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:writing 3'b111 clears  the Address latched after parity error for B1TCM of CR5A" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="B0CM1_ERRADDR_CLR" width="3" begin="14" end="12" resetval="0x0" description="Write pulse bit field:writing 3'b111 clears  the Address latched after parity error for B0TCM of CR5B" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="B0TCM0_ERRADDR_CLR" width="3" begin="10" end="8" resetval="0x0" description="Write pulse bit field:writing 3'b111 clears  the Address latched after parity error for B0TCM of CR5A" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="ATCM1_ERRADDR_CLR" width="3" begin="6" end="4" resetval="0x0" description="Write pulse bit field:writing 3'b111 clears  the Address latched after parity error for ATCM of CR5B" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="ATCM0_ERRADDR_CLR" width="3" begin="2" end="0" resetval="0x0" description="Pulse bit-field writing 3'b111 clears  the Address latched after parity error for ATCM of CR5A" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_ADDRPARITY_ERR_ATCM" acronym="MSS_CTRL_R5SS0_CORE0_ADDRPARITY_ERR_ATCM" offset="0x18124" width="24" description="">
		<bitfield id="ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for ATCM of CR5A" range="19 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_ADDRPARITY_ERR_ATCM" acronym="MSS_CTRL_R5SS0_CORE1_ADDRPARITY_ERR_ATCM" offset="0x18128" width="24" description="">
		<bitfield id="ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for ATCM of CR5B" range="19 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_ERR_ADDRPARITY_B0TCM" acronym="MSS_CTRL_R5SS0_CORE0_ERR_ADDRPARITY_B0TCM" offset="0x1812C" width="24" description="">
		<bitfield id="ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B0TCM of CR5A" range="19 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_ERR_ADDRPARITY_B0TCM" acronym="MSS_CTRL_R5SS0_CORE1_ERR_ADDRPARITY_B0TCM" offset="0x18130" width="24" description="">
		<bitfield id="ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B0TCM of CR5B" range="19 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_ERR_ADDRPARITY_B1TCM" acronym="MSS_CTRL_R5SS0_CORE0_ERR_ADDRPARITY_B1TCM" offset="0x18134" width="24" description="">
		<bitfield id="ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B1TCM of CR5A" range="19 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_ERR_ADDRPARITY_B1TCM" acronym="MSS_CTRL_R5SS0_CORE1_ERR_ADDRPARITY_B1TCM" offset="0x18138" width="24" description="">
		<bitfield id="ADDR" width="20" begin="19" end="0" resetval="0x0" description="Address lathched when parity error is occurred for B1TCM of CR5B" range="19 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_TCM_ADDRPARITY_ERRFORCE" acronym="MSS_CTRL_R5SS0_TCM_ADDRPARITY_ERRFORCE" offset="0x1813C" width="24" description="">
		<bitfield id="B1TCM1" width="3" begin="22" end="20" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for B1TCM of CR5B" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="B1TCM0" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for B1TCM of CR5A" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="B0TCM1" width="3" begin="14" end="12" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for B0TCM of CR5B" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="B0TCM0" width="3" begin="10" end="8" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for B0TCM of CR5A" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="ATCM1" width="3" begin="6" end="4" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for ATCM of CR5B" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="ATCM0" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for ATCM of CR5A" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_MASK" acronym="MSS_CTRL_R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_MASK" offset="0x18140" width="8" description="">
		<bitfield id="R5SS1_CPU0_B1TCM0_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B0TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ATCM0_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt for address parity error s  to aggregated Interrupt of corresponding CPU1 : Interrupt is Masked0 : Interrupt is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS" acronym="MSS_CTRL_R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS" offset="0x18144" width="8" description="">
		<bitfield id="R5SS1_CPU0_B1TCM0_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B0TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ATCM0_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_R5SS1_CPU0_TCM_ADDRPARITY_ERRAGG_STATUS_RAW" offset="0x18148" width="8" description="">
		<bitfield id="R5SS1_CPU0_B1TCM0_PARITY_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_B0TCM0_PARITY_ERR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="R5SS1_CPU0_ATCM0_PARITY_ERR" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from address parity error  of corresponding CPU*_TCM_ADDRPARITY_ERRAGG_MASK registerWrie 0x1 to clear this interrupt." range="0" rwaccess="RW"/>
	</register>
