IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_R5SS1_TCM_ADDRPARITY_ERRFORCE" acronym="MSS_CTRL_R5SS1_TCM_ADDRPARITY_ERRFORCE" offset="0x1817C" width="24" description="">
		<bitfield id="B1TCM1" width="3" begin="22" end="20" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for B1TCM of CR5B" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="B1TCM0" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for B1TCM of CR5A" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="B0TCM1" width="3" begin="14" end="12" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for B0TCM of CR5B" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="B0TCM0" width="3" begin="10" end="8" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for B0TCM of CR5A" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="ATCM1" width="3" begin="6" end="4" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for ATCM of CR5B" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="ATCM0" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:writing 3'b111 forces  a parity error for ATCM of CR5A" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPCC0_PARITY_CTRL" acronym="MSS_CTRL_TPCC0_PARITY_CTRL" offset="0x18180" width="16" description="">
		<bitfield id="TPCC_A_PARITY_ERR_CLR" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:parity clear bit. Writing 1'b1 will clear the tpcc_a_parity_addr" range="16" rwaccess="RW"/> 
		<bitfield id="TPCC_A_PARITY_TESTEN" width="1" begin="4" end="4" resetval="0x0" description="parity test enable for tpcc a" range="4" rwaccess="RW"/> 
		<bitfield id="TPCC_A_PARITY_EN" width="1" begin="0" end="0" resetval="0x0" description="writing 1'b1 enables parity for TPCC_A" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_TPCC0_PARITY_STATUS" acronym="MSS_CTRL_TPCC0_PARITY_STATUS" offset="0x18184" width="8" description="">
		<bitfield id="TPCC_A_PARITY_ADDR" width="9" begin="8" end="0" resetval="0x0" description="address where parity error happened for tpcca" range="8 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_BUS_SAFETY_CTRL" acronym="MSS_CTRL_BUS_SAFETY_CTRL" offset="0x18200" width="8" description="">
		<bitfield id="ENABLE" width="3" begin="2" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_CTRL" acronym="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_CTRL" offset="0x18220" width="24" description="">
		<bitfield id="TYPE" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="8" rwaccess="RW"/> 
		<bitfield id="ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Refer to AM602 Substem Microarch document for more details" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_FI" acronym="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_FI" offset="0x18224" width="32" description="">
		<bitfield id="SAFE" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="MAIN" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="DATA" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="DED" width="1" begin="5" end="5" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="5" rwaccess="RW"/> 
		<bitfield id="SEC" width="1" begin="4" end="4" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="4" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE_REQ" width="1" begin="3" end="3" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="3" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN_REQ" width="1" begin="2" end="2" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="2" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE" width="1" begin="1" end="1" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="1" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN" width="1" begin="0" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_ERR" acronym="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_ERR" offset="0x18228" width="32" description="">
		<bitfield id="DED" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="SEC" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="COMP_CHECK" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="COMP_ERR" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" acronym="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" offset="0x1822C" width="16" description="">
		<bitfield id="D1" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="D0" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" acronym="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" offset="0x18230" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_READ" acronym="MSS_CTRL_R5SS0_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_READ" offset="0x18234" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AXI_RD_BUS_SAFETY_CTRL" acronym="MSS_CTRL_R5SS0_CORE1_AXI_RD_BUS_SAFETY_CTRL" offset="0x18240" width="24" description="">
		<bitfield id="TYPE" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="8" rwaccess="RW"/> 
		<bitfield id="ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Refer to AM602 Substem Microarch document for more details" range="2 - 0" rwaccess="RW"/>
	</register>
