IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_R5SS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" acronym="MSS_CTRL_R5SS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" offset="0x18270" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_READ" acronym="MSS_CTRL_R5SS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_READ" offset="0x18274" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_CTRL" acronym="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_CTRL" offset="0x18280" width="24" description="">
		<bitfield id="TYPE" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="8" rwaccess="RW"/> 
		<bitfield id="ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Refer to AM602 Substem Microarch document for more details" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_FI" acronym="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_FI" offset="0x18284" width="32" description="">
		<bitfield id="SAFE" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="MAIN" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="DATA" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="DED" width="1" begin="5" end="5" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="5" rwaccess="RW"/> 
		<bitfield id="SEC" width="1" begin="4" end="4" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="4" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE_REQ" width="1" begin="3" end="3" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="3" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN_REQ" width="1" begin="2" end="2" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="2" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE" width="1" begin="1" end="1" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="1" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN" width="1" begin="0" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_ERR" acronym="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_ERR" offset="0x18288" width="32" description="">
		<bitfield id="DED" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="SEC" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="COMP_CHECK" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="COMP_ERR" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" acronym="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" offset="0x1828C" width="16" description="">
		<bitfield id="D1" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="D0" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" acronym="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" offset="0x18290" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_READ" acronym="MSS_CTRL_R5SS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_READ" offset="0x18294" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_CTRL" acronym="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_CTRL" offset="0x182A0" width="24" description="">
		<bitfield id="TYPE" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="8" rwaccess="RW"/> 
		<bitfield id="ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Refer to AM602 Substem Microarch document for more details" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_FI" acronym="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_FI" offset="0x182A4" width="32" description="">
		<bitfield id="SAFE" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="MAIN" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="DATA" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="DED" width="1" begin="5" end="5" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="5" rwaccess="RW"/> 
		<bitfield id="SEC" width="1" begin="4" end="4" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="4" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE_REQ" width="1" begin="3" end="3" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="3" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN_REQ" width="1" begin="2" end="2" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="2" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE" width="1" begin="1" end="1" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="1" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN" width="1" begin="0" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR" acronym="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR" offset="0x182A8" width="32" description="">
		<bitfield id="DED" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="SEC" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="COMP_CHECK" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="COMP_ERR" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR_STAT_DATA0" acronym="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR_STAT_DATA0" offset="0x182AC" width="16" description="">
		<bitfield id="D1" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="D0" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR_STAT_CMD" acronym="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR_STAT_CMD" offset="0x182B0" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR_STAT_WRITE" acronym="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR_STAT_WRITE" offset="0x182B4" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR_STAT_WRITERESP" acronym="MSS_CTRL_R5SS0_CORE0_AXI_WR_BUS_SAFETY_ERR_STAT_WRITERESP" offset="0x182B8" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_CTRL" acronym="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_CTRL" offset="0x182C0" width="24" description="">
		<bitfield id="TYPE" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="8" rwaccess="RW"/> 
		<bitfield id="ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Refer to AM602 Substem Microarch document for more details" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_FI" acronym="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_FI" offset="0x182C4" width="32" description="">
		<bitfield id="SAFE" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="MAIN" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="DATA" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="DED" width="1" begin="5" end="5" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="5" rwaccess="RW"/> 
		<bitfield id="SEC" width="1" begin="4" end="4" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="4" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE_REQ" width="1" begin="3" end="3" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="3" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN_REQ" width="1" begin="2" end="2" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="2" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE" width="1" begin="1" end="1" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="1" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN" width="1" begin="0" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR" acronym="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR" offset="0x182C8" width="32" description="">
		<bitfield id="DED" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="SEC" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="COMP_CHECK" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="COMP_ERR" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR_STAT_DATA0" acronym="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR_STAT_DATA0" offset="0x182CC" width="16" description="">
		<bitfield id="D1" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="D0" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR_STAT_CMD" acronym="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR_STAT_CMD" offset="0x182D0" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR_STAT_WRITE" acronym="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR_STAT_WRITE" offset="0x182D4" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR_STAT_WRITERESP" acronym="MSS_CTRL_R5SS0_CORE1_AXI_WR_BUS_SAFETY_ERR_STAT_WRITERESP" offset="0x182D8" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_R5SS1_CORE0_AXI_WR_BUS_SAFETY_CTRL" acronym="MSS_CTRL_R5SS1_CORE0_AXI_WR_BUS_SAFETY_CTRL" offset="0x182E0" width="24" description="">
		<bitfield id="TYPE" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="8" rwaccess="RW"/> 
		<bitfield id="ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Refer to AM602 Substem Microarch document for more details" range="2 - 0" rwaccess="RW"/>
	</register>
