IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_FI" acronym="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_FI" offset="0x187C4" width="32" description="">
		<bitfield id="SAFE" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="MAIN" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="DATA" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="DED" width="1" begin="5" end="5" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="5" rwaccess="RW"/> 
		<bitfield id="SEC" width="1" begin="4" end="4" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="4" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE_REQ" width="1" begin="3" end="3" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="3" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN_REQ" width="1" begin="2" end="2" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="2" rwaccess="RW"/> 
		<bitfield id="GLOBAL_SAFE" width="1" begin="1" end="1" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="1" rwaccess="RW"/> 
		<bitfield id="GLOBAL_MAIN" width="1" begin="0" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR" acronym="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR" offset="0x187C8" width="32" description="">
		<bitfield id="DED" width="8" begin="31" end="24" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="SEC" width="8" begin="23" end="16" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="COMP_CHECK" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="COMP_ERR" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_DATA0" acronym="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_DATA0" offset="0x187CC" width="16" description="">
		<bitfield id="D1" width="8" begin="15" end="8" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="D0" width="8" begin="7" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_CMD" acronym="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_CMD" offset="0x187D0" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_WRITE" acronym="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_WRITE" offset="0x187D4" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_READ" acronym="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_READ" offset="0x187D8" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_WRITERESP" acronym="MSS_CTRL_PERI_VBUSP_BUS_SAFETY_ERR_STAT_WRITERESP" offset="0x187DC" width="32" description="">
		<bitfield id="STAT" width="32" begin="31" end="0" resetval="0x0" description="Refer to AM602 Substem Microarch document for more details" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_NERROR_MASK" acronym="MSS_CTRL_NERROR_MASK" offset="0x18820" width="8" description="">
		<bitfield id="MASK" width="3" begin="2" end="0" resetval="0x0" description="writing 3'b111 will mask the Nerror propagation to padWriting 3'b000 will unmask the Nerror propagation to pad" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MSS_BUS_SAFETY_SEC_ERR_STAT0" acronym="MSS_CTRL_MSS_BUS_SAFETY_SEC_ERR_STAT0" offset="0x18824" width="32" description="">
		<bitfield id="ICSSM_SLAVE" width="1" begin="30" end="30" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="30" rwaccess="RO"/> 
		<bitfield id="ICSSM_PDSP1" width="1" begin="29" end="29" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="29" rwaccess="RO"/> 
		<bitfield id="ICSSM_PDSP0" width="1" begin="28" end="28" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="28" rwaccess="RO"/> 
		<bitfield id="MSS_MBOX" width="1" begin="27" end="27" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="27" rwaccess="RO"/> 
		<bitfield id="L2RAM3" width="1" begin="26" end="26" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="26" rwaccess="RO"/> 
		<bitfield id="L2RAM2" width="1" begin="25" end="25" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="25" rwaccess="RO"/> 
		<bitfield id="L2RAM1" width="1" begin="24" end="24" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="24" rwaccess="RO"/> 
		<bitfield id="L2RAM0" width="1" begin="23" end="23" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="23" rwaccess="RO"/> 
		<bitfield id="SCRM2SCRP_1" width="1" begin="22" end="22" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="22" rwaccess="RO"/> 
		<bitfield id="SCRM2SCRP_0" width="1" begin="21" end="21" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="21" rwaccess="RO"/> 
		<bitfield id="DTHE" width="1" begin="20" end="20" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="20" rwaccess="RO"/> 
		<bitfield id="HSM_S" width="1" begin="19" end="19" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="19" rwaccess="RO"/> 
		<bitfield id="MCRC" width="1" begin="18" end="18" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="18" rwaccess="RO"/> 
		<bitfield id="QSPI" width="1" begin="17" end="17" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="17" rwaccess="RO"/> 
		<bitfield id="HSM_TPTC_A1_WR" width="1" begin="16" end="16" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="16" rwaccess="RO"/> 
		<bitfield id="HSM_TPTC_A1_RD" width="1" begin="15" end="15" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="15" rwaccess="RO"/> 
		<bitfield id="HSM_TPTC_A0_WR" width="1" begin="14" end="14" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="14" rwaccess="RO"/> 
		<bitfield id="HSM_TPTC_A0_RD" width="1" begin="13" end="13" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="13" rwaccess="RO"/> 
		<bitfield id="MSS_TPTC_A1_WR" width="1" begin="12" end="12" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="12" rwaccess="RO"/> 
		<bitfield id="MSS_TPTC_A0_WR" width="1" begin="11" end="11" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="11" rwaccess="RO"/> 
		<bitfield id="MSS_TPTC_A1_RD" width="1" begin="10" end="10" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="10" rwaccess="RO"/> 
		<bitfield id="MSS_TPTC_A0_RD" width="1" begin="9" end="9" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="9" rwaccess="RO"/> 
		<bitfield id="CPSW" width="1" begin="8" end="8" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="8" rwaccess="RO"/> 
		<bitfield id="HSM" width="1" begin="7" end="7" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="7" rwaccess="RO"/> 
		<bitfield id="DAP" width="1" begin="6" end="6" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="6" rwaccess="RO"/> 
		<bitfield id="CR5B_SLV" width="1" begin="5" end="5" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="5" rwaccess="RO"/> 
		<bitfield id="CR5A_SLV" width="1" begin="4" end="4" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="4" rwaccess="RO"/> 
		<bitfield id="CR5B_WR" width="1" begin="3" end="3" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="3" rwaccess="RO"/> 
		<bitfield id="CR5A_WR" width="1" begin="2" end="2" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="2" rwaccess="RO"/> 
		<bitfield id="CR5B_RD" width="1" begin="1" end="1" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="1" rwaccess="RO"/> 
		<bitfield id="CR5A_RD" width="1" begin="0" end="0" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_MSS_BUS_SAFETY_SEC_ERR_STAT1" acronym="MSS_CTRL_MSS_BUS_SAFETY_SEC_ERR_STAT1" offset="0x18828" width="32" description="">
		<bitfield id="CR5A1_WR" width="1" begin="26" end="26" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="26" rwaccess="RO"/> 
		<bitfield id="CR5B1_RD" width="1" begin="25" end="25" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="25" rwaccess="RO"/> 
		<bitfield id="CR5A1_RD" width="1" begin="24" end="24" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="24" rwaccess="RO"/> 
		<bitfield id="GPMC" width="1" begin="5" end="5" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="5" rwaccess="RO"/> 
		<bitfield id="MMC" width="1" begin="4" end="4" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="4" rwaccess="RO"/> 
		<bitfield id="STM_STIM" width="1" begin="3" end="3" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="3" rwaccess="RO"/> 
		<bitfield id="CR5B1_SLV" width="1" begin="2" end="2" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="2" rwaccess="RO"/> 
		<bitfield id="CR5A1_SLV" width="1" begin="1" end="1" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="1" rwaccess="RO"/> 
		<bitfield id="CR5B1_WR" width="1" begin="0" end="0" resetval="0x0" description="Bus safety single-bit-error of Node mentioned in the field" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_CTRL_MSS_VBUSM_SAFETY_H_ERRAGG_MASK0" acronym="MSS_CTRL_MSS_VBUSM_SAFETY_H_ERRAGG_MASK0" offset="0x18834" width="32" description="">
		<bitfield id="DTHE_VBUSM_ERRH" width="1" begin="31" end="31" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="31" rwaccess="RW"/> 
		<bitfield id="MCRC_VBUSM_ERRH" width="1" begin="30" end="30" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="30" rwaccess="RW"/> 
		<bitfield id="QSPI_VBUSM_ERRH" width="1" begin="29" end="29" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="29" rwaccess="RW"/> 
		<bitfield id="ICSSM_PDSP1_VBUSM_ERRH" width="1" begin="28" end="28" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="28" rwaccess="RW"/> 
		<bitfield id="ICSSM_PDSP0_VBUSM_ERRH" width="1" begin="27" end="27" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="27" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC1_WR_VBUSM_ERRH" width="1" begin="26" end="26" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="26" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC1_RD_VBUSM_ERRH" width="1" begin="25" end="25" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="25" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC0_WR_VBUSM_ERRH" width="1" begin="24" end="24" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="24" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC0_RD_VBUSM_ERRH" width="1" begin="23" end="23" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="23" rwaccess="RW"/> 
		<bitfield id="TPTC1_WR_VBUSM_ERRH" width="1" begin="22" end="22" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="22" rwaccess="RW"/> 
		<bitfield id="TPTC0_WR_VBUSM_ERRH" width="1" begin="21" end="21" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="21" rwaccess="RW"/> 
		<bitfield id="TPTC1_RD_VBUSM_ERRH" width="1" begin="20" end="20" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="20" rwaccess="RW"/> 
		<bitfield id="TPTC0_RD_VBUSM_ERRH" width="1" begin="19" end="19" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="19" rwaccess="RW"/> 
		<bitfield id="L2RAM3_VBUSM_ERRH" width="1" begin="18" end="18" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="18" rwaccess="RW"/> 
		<bitfield id="L2RAM2_VBUSM_ERRH" width="1" begin="17" end="17" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="17" rwaccess="RW"/> 
		<bitfield id="L2RAM1_VBUSM_ERRH" width="1" begin="16" end="16" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="16" rwaccess="RW"/> 
		<bitfield id="L2RAM0_VBUSM_ERRH" width="1" begin="15" end="15" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="15" rwaccess="RW"/> 
		<bitfield id="CPSW_VBUSM_ERRH" width="1" begin="14" end="14" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="14" rwaccess="RW"/> 
		<bitfield id="HSM_VBUSM_ERRH" width="1" begin="13" end="13" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="13" rwaccess="RW"/> 
		<bitfield id="DAP_VBUSM_ERRH" width="1" begin="12" end="12" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="12" rwaccess="RW"/> 
		<bitfield id="CR5B1_SLV_VBUSM_ERRH" width="1" begin="11" end="11" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="11" rwaccess="RW"/> 
		<bitfield id="CR5A1_SLV_VBUSM_ERRH" width="1" begin="10" end="10" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="10" rwaccess="RW"/> 
		<bitfield id="CR5B1_WR_VBUSM_ERRH" width="1" begin="9" end="9" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="9" rwaccess="RW"/> 
		<bitfield id="CR5A1_WR_VBUSM_ERRH" width="1" begin="8" end="8" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="8" rwaccess="RW"/> 
		<bitfield id="CR5B1_RD_VBUSM_ERRH" width="1" begin="7" end="7" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="7" rwaccess="RW"/> 
		<bitfield id="CR5A1_RD_VBUSM_ERRH" width="1" begin="6" end="6" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="6" rwaccess="RW"/> 
		<bitfield id="CR5B0_SLV_VBUSM_ERRH" width="1" begin="5" end="5" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="CR5A0_SLV_VBUSM_ERRH" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="CR5B0_WR_VBUSM_ERRH" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A0_WR_VBUSM_ERRH" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0_RD_VBUSM_ERRH" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0_RD_VBUSM_ERRH" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H0_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="0" rwaccess="RW"/>
	</register>
