IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_MSS_VBUSM_SAFETY_H_ERRAGG_STATUS0" acronym="MSS_CTRL_MSS_VBUSM_SAFETY_H_ERRAGG_STATUS0" offset="0x18838" width="32" description="">
		<bitfield id="DTHE_VBUSM_ERRH" width="1" begin="31" end="31" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="31" rwaccess="RW"/> 
		<bitfield id="MCRC_VBUSM_ERRH" width="1" begin="30" end="30" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="30" rwaccess="RW"/> 
		<bitfield id="QSPI_VBUSM_ERRH" width="1" begin="29" end="29" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="29" rwaccess="RW"/> 
		<bitfield id="ICSSM_PDSP1_VBUSM_ERRH" width="1" begin="28" end="28" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="28" rwaccess="RW"/> 
		<bitfield id="ICSSM_PDSP0_VBUSM_ERRH" width="1" begin="27" end="27" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="27" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC1_WR_VBUSM_ERRH" width="1" begin="26" end="26" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="26" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC1_RD_VBUSM_ERRH" width="1" begin="25" end="25" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="25" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC0_WR_VBUSM_ERRH" width="1" begin="24" end="24" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="24" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC0_RD_VBUSM_ERRH" width="1" begin="23" end="23" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="23" rwaccess="RW"/> 
		<bitfield id="TPTC1_WR_VBUSM_ERRH" width="1" begin="22" end="22" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="22" rwaccess="RW"/> 
		<bitfield id="TPTC0_WR_VBUSM_ERRH" width="1" begin="21" end="21" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="21" rwaccess="RW"/> 
		<bitfield id="TPTC1_RD_VBUSM_ERRH" width="1" begin="20" end="20" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="20" rwaccess="RW"/> 
		<bitfield id="TPTC0_RD_VBUSM_ERRH" width="1" begin="19" end="19" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="19" rwaccess="RW"/> 
		<bitfield id="L2RAM3_VBUSM_ERRH" width="1" begin="18" end="18" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="18" rwaccess="RW"/> 
		<bitfield id="L2RAM2_VBUSM_ERRH" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="RW"/> 
		<bitfield id="L2RAM1_VBUSM_ERRH" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="RW"/> 
		<bitfield id="L2RAM0_VBUSM_ERRH" width="1" begin="15" end="15" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="15" rwaccess="RW"/> 
		<bitfield id="CPSW_VBUSM_ERRH" width="1" begin="14" end="14" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="14" rwaccess="RW"/> 
		<bitfield id="HSM_VBUSM_ERRH" width="1" begin="13" end="13" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="13" rwaccess="RW"/> 
		<bitfield id="DAP_VBUSM_ERRH" width="1" begin="12" end="12" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="12" rwaccess="RW"/> 
		<bitfield id="CR5B1_SLV_VBUSM_ERRH" width="1" begin="11" end="11" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="11" rwaccess="RW"/> 
		<bitfield id="CR5A1_SLV_VBUSM_ERRH" width="1" begin="10" end="10" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="10" rwaccess="RW"/> 
		<bitfield id="CR5B1_WR_VBUSM_ERRH" width="1" begin="9" end="9" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="9" rwaccess="RW"/> 
		<bitfield id="CR5A1_WR_VBUSM_ERRH" width="1" begin="8" end="8" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="8" rwaccess="RW"/> 
		<bitfield id="CR5B1_RD_VBUSM_ERRH" width="1" begin="7" end="7" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="7" rwaccess="RW"/> 
		<bitfield id="CR5A1_RD_VBUSM_ERRH" width="1" begin="6" end="6" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="6" rwaccess="RW"/> 
		<bitfield id="CR5B0_SLV_VBUSM_ERRH" width="1" begin="5" end="5" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="5" rwaccess="RW"/> 
		<bitfield id="CR5A0_SLV_VBUSM_ERRH" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="RW"/> 
		<bitfield id="CR5B0_WR_VBUSM_ERRH" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="RW"/> 
		<bitfield id="CR5A0_WR_VBUSM_ERRH" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0_RD_VBUSM_ERRH" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0_RD_VBUSM_ERRH" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="RW"/>
	</register>
