IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_MSS_VBUSM_SAFETY_H_ERRAGG_STATUS_RAW0" acronym="MSS_CTRL_MSS_VBUSM_SAFETY_H_ERRAGG_STATUS_RAW0" offset="0x1883C" width="32" description="">
		<bitfield id="DTHE_VBUSM_ERRH" width="1" begin="31" end="31" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="31" rwaccess="RW"/> 
		<bitfield id="MCRC_VBUSM_ERRH" width="1" begin="30" end="30" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="30" rwaccess="RW"/> 
		<bitfield id="QSPI_VBUSM_ERRH" width="1" begin="29" end="29" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="29" rwaccess="RW"/> 
		<bitfield id="ICSSM_PDSP1_VBUSM_ERRH" width="1" begin="28" end="28" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="28" rwaccess="RW"/> 
		<bitfield id="ICSSM_PDSP0_VBUSM_ERRH" width="1" begin="27" end="27" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="27" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC1_WR_VBUSM_ERRH" width="1" begin="26" end="26" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="26" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC1_RD_VBUSM_ERRH" width="1" begin="25" end="25" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="25" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC0_WR_VBUSM_ERRH" width="1" begin="24" end="24" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="24" rwaccess="RW"/> 
		<bitfield id="HSM_TPTC0_RD_VBUSM_ERRH" width="1" begin="23" end="23" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="23" rwaccess="RW"/> 
		<bitfield id="TPTC1_WR_VBUSM_ERRH" width="1" begin="22" end="22" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="22" rwaccess="RW"/> 
		<bitfield id="TPTC0_WR_VBUSM_ERRH" width="1" begin="21" end="21" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="21" rwaccess="RW"/> 
		<bitfield id="TPTC1_RD_VBUSM_ERRH" width="1" begin="20" end="20" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="20" rwaccess="RW"/> 
		<bitfield id="TPTC0_RD_VBUSM_ERRH" width="1" begin="19" end="19" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="19" rwaccess="RW"/> 
		<bitfield id="L2RAM3_VBUSM_ERRH" width="1" begin="18" end="18" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="18" rwaccess="RW"/> 
		<bitfield id="L2RAM2_VBUSM_ERRH" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="17" rwaccess="RW"/> 
		<bitfield id="L2RAM1_VBUSM_ERRH" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="16" rwaccess="RW"/> 
		<bitfield id="L2RAM0_VBUSM_ERRH" width="1" begin="15" end="15" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="15" rwaccess="RW"/> 
		<bitfield id="CPSW_VBUSM_ERRH" width="1" begin="14" end="14" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="14" rwaccess="RW"/> 
		<bitfield id="HSM_VBUSM_ERRH" width="1" begin="13" end="13" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="13" rwaccess="RW"/> 
		<bitfield id="DAP_VBUSM_ERRH" width="1" begin="12" end="12" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="12" rwaccess="RW"/> 
		<bitfield id="CR5B1_SLV_VBUSM_ERRH" width="1" begin="11" end="11" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="11" rwaccess="RW"/> 
		<bitfield id="CR5A1_SLV_VBUSM_ERRH" width="1" begin="10" end="10" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="10" rwaccess="RW"/> 
		<bitfield id="CR5B1_WR_VBUSM_ERRH" width="1" begin="9" end="9" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="9" rwaccess="RW"/> 
		<bitfield id="CR5A1_WR_VBUSM_ERRH" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="8" rwaccess="RW"/> 
		<bitfield id="CR5B1_RD_VBUSM_ERRH" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="7" rwaccess="RW"/> 
		<bitfield id="CR5A1_RD_VBUSM_ERRH" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="6" rwaccess="RW"/> 
		<bitfield id="CR5B0_SLV_VBUSM_ERRH" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="5" rwaccess="RW"/> 
		<bitfield id="CR5A0_SLV_VBUSM_ERRH" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="4" rwaccess="RW"/> 
		<bitfield id="CR5B0_WR_VBUSM_ERRH" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A0_WR_VBUSM_ERRH" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0_RD_VBUSM_ERRH" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0_RD_VBUSM_ERRH" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_H0_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_H0_ERRAGG_ERRAGG_MASK" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MSS_VBUSM_SAFETY_H_ERRAGG_MASK1" acronym="MSS_CTRL_MSS_VBUSM_SAFETY_H_ERRAGG_MASK1" offset="0x18844" width="8" description="">
		<bitfield id="GPMC_VBUSM_ERRH" width="1" begin="7" end="7" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="7" rwaccess="RW"/> 
		<bitfield id="MMC_VBUSM_ERRH" width="1" begin="6" end="6" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="6" rwaccess="RW"/> 
		<bitfield id="STM_STIM_VBUSM_ERRH" width="1" begin="5" end="5" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_VBUSM_ERRH" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="ICSSMSLAVE_VBUSM_ERRH" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="HSM_S_VBUSM_ERRH" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="SCRM2SCRP_1_VBUSM_ERRH" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="SCRM2SCRP_0_VBUSM_ERRH" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_H1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_H1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="0" rwaccess="RW"/>
	</register>
