IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_CTRL_MSS_CTRL.xml
	<register id="MSS_CTRL_MSS_VBUSM_SAFETY_L_ERRAGG_MASK1" acronym="MSS_CTRL_MSS_VBUSM_SAFETY_L_ERRAGG_MASK1" offset="0x18864" width="8" description="">
		<bitfield id="GPMC_VBUSM_ERRL" width="1" begin="7" end="7" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_L1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="7" rwaccess="RW"/> 
		<bitfield id="MMC_VBUSM_ERRL" width="1" begin="6" end="6" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_L1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="6" rwaccess="RW"/> 
		<bitfield id="STM_STIM_VBUSM_ERRL" width="1" begin="5" end="5" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_L1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_VBUSM_ERRL" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_L1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="ICSSMSLAVE_VBUSM_ERRL" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_L1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="HSM_S_VBUSM_ERRL" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_L1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="SCRM2SCRP_1_VBUSM_ERRL" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_L1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="SCRM2SCRP_0_VBUSM_ERRL" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MSS_VBUSM_SAFETY_L1_ERRAGG to aggregated Error MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MSS_VBUSM_SAFETY_L_ERRAGG_STATUS1" acronym="MSS_CTRL_MSS_VBUSM_SAFETY_L_ERRAGG_STATUS1" offset="0x18868" width="8" description="">
		<bitfield id="GPMC_VBUSM_ERRL" width="1" begin="7" end="7" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="7" rwaccess="RW"/> 
		<bitfield id="MMC_VBUSM_ERRL" width="1" begin="6" end="6" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="6" rwaccess="RW"/> 
		<bitfield id="STM_STIM_VBUSM_ERRL" width="1" begin="5" end="5" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_VBUSM_ERRL" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="RW"/> 
		<bitfield id="ICSSMSLAVE_VBUSM_ERRL" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="RW"/> 
		<bitfield id="HSM_S_VBUSM_ERRL" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="RW"/> 
		<bitfield id="SCRM2SCRP_1_VBUSM_ERRL" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="RW"/> 
		<bitfield id="SCRM2SCRP_0_VBUSM_ERRL" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MSS_VBUSM_SAFETY_L_ERRAGG_STATUS_RAW1" acronym="MSS_CTRL_MSS_VBUSM_SAFETY_L_ERRAGG_STATUS_RAW1" offset="0x1886C" width="8" description="">
		<bitfield id="GPMC_VBUSM_ERRL" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASK" range="7" rwaccess="RW"/> 
		<bitfield id="MMC_VBUSM_ERRL" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASK" range="6" rwaccess="RW"/> 
		<bitfield id="STM_STIM_VBUSM_ERRL" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASK" range="5" rwaccess="RW"/> 
		<bitfield id="MSS_MBOX_VBUSM_ERRL" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASK" range="4" rwaccess="RW"/> 
		<bitfield id="ICSSMSLAVE_VBUSM_ERRL" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASK" range="3" rwaccess="RW"/> 
		<bitfield id="HSM_S_VBUSM_ERRL" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASK" range="2" rwaccess="RW"/> 
		<bitfield id="SCRM2SCRP_1_VBUSM_ERRL" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASK" range="1" rwaccess="RW"/> 
		<bitfield id="SCRM2SCRP_0_VBUSM_ERRL" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MSS_VBUSM_SAFETY_L1_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSM_SAFETY_L1_ERRAGG_ERRAGG_MASK" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MSS_VBUSP_SAFETY_H_ERRAGG_MASK" acronym="MSS_CTRL_MSS_VBUSP_SAFETY_H_ERRAGG_MASK" offset="0x18874" width="8" description="">
		<bitfield id="PERI_VBUSP_VBUSP_ERRH" width="1" begin="5" end="5" resetval="0x0" description="Mask Error from MSS_VBUSP_SAFETY_H_ERRAGG to aggregated Error MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="5" rwaccess="RW"/> 
		<bitfield id="MAIN_VBUSP_VBUSP_ERRH" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MSS_VBUSP_SAFETY_H_ERRAGG to aggregated Error MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="4" rwaccess="RW"/> 
		<bitfield id="CR5B1_AHB_VBUSP_ERRH" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MSS_VBUSP_SAFETY_H_ERRAGG to aggregated Error MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1_AHB_VBUSP_ERRH" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MSS_VBUSP_SAFETY_H_ERRAGG to aggregated Error MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0_AHB_VBUSP_ERRH" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MSS_VBUSP_SAFETY_H_ERRAGG to aggregated Error MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0_AHB_VBUSP_ERRH" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MSS_VBUSP_SAFETY_H_ERRAGG to aggregated Error MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG1 : Error is Masked0 : Error is Unmasked" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MSS_VBUSP_SAFETY_H_ERRAGG_STATUS" acronym="MSS_CTRL_MSS_VBUSP_SAFETY_H_ERRAGG_STATUS" offset="0x18878" width="8" description="">
		<bitfield id="PERI_VBUSP_VBUSP_ERRH" width="1" begin="5" end="5" resetval="0x0" description="Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="5" rwaccess="RW"/> 
		<bitfield id="MAIN_VBUSP_VBUSP_ERRH" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="RW"/> 
		<bitfield id="CR5B1_AHB_VBUSP_ERRH" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1_AHB_VBUSP_ERRH" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0_AHB_VBUSP_ERRH" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0_AHB_VBUSP_ERRH" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set only if Interupt is unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_CTRL_MSS_VBUSP_SAFETY_H_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_MSS_VBUSP_SAFETY_H_ERRAGG_STATUS_RAW" offset="0x1887C" width="8" description="">
		<bitfield id="PERI_VBUSP_VBUSP_ERRH" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASK" range="5" rwaccess="RW"/> 
		<bitfield id="MAIN_VBUSP_VBUSP_ERRH" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASK" range="4" rwaccess="RW"/> 
		<bitfield id="CR5B1_AHB_VBUSP_ERRH" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASK" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1_AHB_VBUSP_ERRH" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASK" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0_AHB_VBUSP_ERRH" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASK" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0_AHB_VBUSP_ERRH" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MSS_VBUSP_SAFETY_H_ERRAGG. Set irrespective if the Interupt is masked or unmasked in MSS_VBUSP_SAFETY_H_ERRAGG_ERRAGG_MASK" range="0" rwaccess="RW"/>
	</register>
</module>